{
  "intents": [
    {
      "tag": "gptQuery",
      "patterns": [""],
      "responses": [""],
      "context": "gpt"
    },
    {
      "tag": "name",
      "patterns": [
        "What's your name?",
        "What is your name?",
        "What are you?",
        "Who are you?",
        "What are you exactly?",
        "Tell me your name",
        "Give me your name",
        "Tell me what you are",
        "Tell me who you are",
        "What exactly are you?",
        "Tell me what your name is",
        "Can you tell me what you are?",
        "Can you tell me your name?",
        "Can you tell me who you are?",
        "So what are you exactly?",
        "So what are you?",
        "Do you know who you are?",
        "Do you know what your name is?",
        "Your name?",
        "Would you be able to tell me your name?",
        "What would your name be?"
      ],
      "responses": [
        "My name is CELESTE.",
        "I'm CELESTE, an AI Weatherbot.",
        "My name is CELESTE, I am an AI Weatherbot.",
        "You can call me CELESTE, I am an AI Weatherbot.",
        "I am known as CELESTE. I am an AI developed by Mar AI.",
        "You can call me CELESTE.",
        "Call me CELESTE.",
        "I am CELESTE, an AI Weather system created by Mar AI."
      ]
    },
    {
      "tag": "currentDewPoint",
      "patterns": [
        "What is the dew point right now?",
        "What is the current dew point?",
        "What is the dew point rn?",
        "Whats the dew point rn?",
        "Can you tell me the dew point?",
        "What is the dew point in my area?",
        "Can you give me the dew point information?",
        "Could you let me know the dew point?",
        "What is the dew point temperature?",
        "Can you provide the dew point data?",
        "What is the current dew point temperature?",
        "Can you give me an update on the dew point?",
        "Could you tell me the dew point for my location?",
        "Can you give me the dew point forecast?",
        "What is the dew point reading?",
        "Can you share the dew point information?",
        "Could you provide the current dew point?",
        "What is the dew point level?",
        "Can you give me the dew point statistics?",
        "Could you tell me the dew point conditions?",
        "What is the dew point trend?",
        "Can you provide the dew point measurement?",
        "What is the dew point humidity?",
        "Can you give me the dew point update?",
        "Could you tell me the dew point forecast?",
        "What is the dew point index?",
        "Can you give me the dew point data for my location?",
        "What is the dew point scale?",
        "Can you provide the dew point reading?",
        "What is the dew point in my city?",
        "Can you give me the dew point for my region?",
        "What is the dew point for my ZIP code?",
        "What's the dew point like currently?",
        "Can you tell me the dew point temperature at this moment?",
        "What's the dew point situation?",
        "Can you give me the dew point for my location now?",
        "Could you let me know the current dew point?",
        "What's the dew point like in my area?",
        "Can you provide me with the current dew point information?",
        "What's the dew point reading in my city?",
        "Can you give me an update on the dew point in my region?",
        "Could you tell me the dew point forecast for my location?",
        "What's the dew point humidity level?",
        "Can you share the dew point information for my area?",
        "Could you give me the current dew point for my ZIP code?",
        "What's the dew point trend in my region?",
        "Can you provide me with the dew point measurement?",
        "What's the dew point conditions in my city?",
        "Can you give me the dew point update for my area?",
        "Could you tell me the dew point index for my location?",
        "What's the dew point like in my town?",
        "Can you give me the dew point for my neighborhood?",
        "What's the dew point for my street?",
        "Can you give me the dew point prediction for the current time?",
        "What is the dew point temperature at this moment?",
        "What is the dew point currently like in this area?",
        "What is the forecast for the dew point in this location?",
        "What are the dew levels like?",
        "Can you tell me what the dew levels are currently?",
        "Are you able to give me a dew point reading?",
        "What does the dew point in this area look like?",
        "What is the dew point reading right now?"
      ],
      "responses": [
        "The dew point in this area is currently {} Kelvin, or {}° Fahrenheit.",
        "This area's current dew point is {} Kelvin, or {}° Fahrenheit.",
        "In this area, the current dew point is {} Kelvin, or {}° Fahrenheit.",
        "The dew point in this area is currently {} Kelvin ({}° Fahrenheit).",
        "My records indicate that the dew point in this area is currently {} Kelvin ({}°F).",
        "Records indicate a dew level of {} Kelvin ({}°F).",
        "The current dew level in this area {} Kelvin ({}°F).",
        "Currently {} Kelvin ({}°F).",
        "{} Kelvin, or {} degrees Fahrenheit.",
        "Kelvin: {}\nFahrenheit: {}°F"
      ],
      "context": "dew current"
    },
    {
      "tag": "currentUvi",
      "patterns": [
        "What's the current UVI?",
        "Can you tell me the current UV index?",
        "What's the UV index now?",
        "Can you give me the current UV radiation level?",
        "Could you let me know the current UVI?",
        "What's the UVI situation?",
        "Can you provide me with the current UVI information?",
        "What's the current UVI reading?",
        "Whats the UVI rn?",
        "What is the UVI index rn?",
        "Whats the UVI like rn?",
        "What is the UV index outside rn?",
        "Can you give me an update on the UVI?",
        "Could you tell me the current UVI forecast?",
        "What's the UVI level now?",
        "Can you share the UVI information for my location?",
        "Could you give me the current UVI for my city?",
        "What's the UVI trend?",
        "What's the uvi like?",
        "Can you provide me with the UVI measurement?",
        "What's the UVI conditions?",
        "Can you give me the UVI update?",
        "Could you tell me the UVI index?",
        "What's the UVI like in my area?",
        "Can you give me the UVI for my region?",
        "What's the UVI for my ZIP code?",
        "What's the current UVI index?",
        "Can you tell me the UVI level?",
        "What's the UV radiation like now?",
        "Can you give me the current UV index for my location?",
        "Could you let me know the UVI situation?",
        "What's the UVI reading now?",
        "Can you provide me with the current UVI forecast?",
        "What's the UV intensity now?",
        "Can you give me an update on the UV index?",
        "Could you tell me the UVI index for my city?",
        "What's the UVI level at present?",
        "Can you share the UVI information for my area?",
        "Could you give me the current UVI for my region?",
        "What's the UVI trend right now?",
        "Can you provide me with the UVI measurement at this moment?",
        "What's the UVI conditions currently?",
        "Can you give me the UVI update for my location?",
        "Could you tell me the UVI index for my neighborhood?",
        "What's the UVI like in my city?",
        "What's the UV index like?",
        "Can you give me the UVI for my street?",
        "What's the UVI for my current location?",
        "Can you tell me the UV index for my city?",
        "What's the UV radiation level currently?",
        "Can you give me the current UVI for my area?",
        "Could you let me know the UVI situation for my location?",
        "What's the UVI reading like now?",
        "Can you provide me with the UVI forecast for the current time?",
        "What's the UV intensity like at the moment?",
        "Can you give me an update on the UVI for my location?",
        "Could you tell me the UVI index for the current time?",
        "What's the UVI level like right now?",
        "Can you share the UVI information for my region?",
        "Could you give me the current UVI for my neighborhood?",
        "What's the UVI trend like currently?",
        "Can you provide me with the UVI measurement for the present time?",
        "What's the current UV Index?",
        "Can you tell me the current UV Index level?",
        "What's the UV Index like now?",
        "Can you give me the current UV Index for my location?",
        "Could you let me know the UV Index situation?",
        "What's the UV Index reading now?",
        "Can you provide me with the current UV Index forecast?",
        "What's the UV Index like at present?",
        "Can you give me an update on the UV Index?",
        "Could you tell me the UV Index for my city?",
        "Yo, what's the current UV index?",
        "UV situation?",
        "What's the UV index like now?",
        "Can you give me an update on the UV?",
        "Could you let me know the UV index?",
        "What's the UV like at the moment?",
        "Can you give me the lowdown on the UV for my area?",
        "UV index right now, you know?",
        "What's the UV index forecast?",
        "Can you tell me the UV radiation level?",
        "what's the uvi index in this area like currently?"
      ],
      "responses": [
        "The UV index in this area is currently {}.",
        "Currently, the UV index is {}.",
        "The UV index is {} right now.",
        "My records indicate a UV index of {}.",
        "Records indicate a UV index of {}.",
        "{}.",
        "Currently, {}.",
        "The current UV index is {}."
      ],
      "context": "uvi current"
    },
    {
      "tag": "currentWind",
      "patterns": [
        "What's the current wind speed?",
        "Is it windy rn?",
        "Is it windy outside rn?",
        "Where is the wind blowing rn?",
        "Where is the wind coming from rn?",
        "What is the wind speed like rn?",
        "Whats the wind like rn?",
        "Can you tell me the current wind speed?",
        "What's the wind speed like now?",
        "Can you give me the current wind speed for my location?",
        "Could you let me know the current wind speed?",
        "What's the wind speed situation?",
        "Can you provide me with the current wind speed information?",
        "What's the current wind speed reading?",
        "Can you give me an update on the wind speed?",
        "Could you tell me the current wind speed forecast?",
        "What's the wind speed level now?",
        "Can you share the wind speed information for my location?",
        "Could you give me the current wind speed for my city?",
        "What's the wind speed trend?",
        "Can you provide me with the wind speed measurement?",
        "What's the wind speed conditions?",
        "Can you give me the wind speed update?",
        "Could you tell me the wind speed index?",
        "What's the wind speed like in my area?",
        "Can you give me the wind speed for my region?",
        "What's the wind speed for my current location?",
        "Can you tell me the wind speed for my city?",
        "What's the wind like currently?",
        "Can you give me the current wind speed for my area?",
        "Could you let me know the wind speed situation for my location?",
        "What's the wind speed reading like now?",
        "Can you provide me with the wind speed forecast for the current time?",
        "What's the wind intensity now?",
        "Can you give me an update on the wind speed for my location?",
        "Could you tell me the wind speed for the current time?",
        "What's the wind speed level like right now?",
        "Can you share the wind speed information for my region?",
        "Could you give me the current wind speed for my neighborhood?",
        "What's the wind speed trend like currently?",
        "Can you provide me with the wind speed measurement for the present time?",
        "What's the wind velocity right now?",
        "Can you tell me the wind gust?",
        "What's the wind like currently?",
        "Can you give me the current wind direction and speed?",
        "Could you let me know the wind gusts?",
        "What's the wind speed forecast?",
        "Can you provide me with the current wind situation?",
        "What's the wind force?",
        "Can you give me an update on the wind?",
        "Could you tell me the wind direction?",
        "What's the wind speed and direction?",
        "Can you share the wind information for my location?",
        "Could you give me the current wind direction?",
        "What's the wind situation?",
        "Can you provide me with the wind measurement?",
        "What's the wind conditions?",
        "Can you give me the wind update?",
        "Could you tell me the wind forecast?",
        "What's the wind like in my area?",
        "Can you give me the wind for my region?",
        "What are the gusts like?",
        "It's windy",
        "How windy is it?",
        "Yo, what's the current wind speed?",
        "Wind speed right now, you know?",
        "Can you tell me what the wind doing?",
        "What's the wind like at the moment?",
        "Can you give me the lowdown on the wind for my area?",
        "Wind situation?",
        "What's the wind speed like now?",
        "Can you give me an update on the wind?",
        "Could you let me know the wind speed?",
        "What's the wind blowing at?",
        "What is the current wind direction?",
        "Can you tell me the wind direction right now?",
        "What direction is the wind blowing?",
        "Could you give me the wind direction?",
        "What's the wind direction currently?",
        "Can you tell me which way the wind is blowing?",
        "Could you give me an update on the wind direction?",
        "What's the current wind direction?",
        "Can you provide me with the wind direction?",
        "What way is the wind blowing right now?",
        "Could you tell me the wind direction at this moment?",
        "Can you give me the current wind direction?",
        "What's the wind direction like currently?",
        "Could you update me on the wind direction?",
        "Can you let me know the wind direction?",
        "What direction is the wind currently blowing?",
        "Could you provide me with the current wind direction?",
        "Can you tell me the wind direction right now?",
        "What's the current wind direction please?",
        "Could you give me the wind direction information?",
        "What is the wind direction currently facing?",
        "Can you tell me the wind's current direction?",
        "Could you provide me with the wind's current direction?",
        "What's the wind's direction now?",
        "Can you give me the present wind direction?",
        "What's the wind direction situation currently?",
        "Could you update me on the present wind direction?",
        "Can you let me know the wind's current direction?",
        "What's the current wind direction status?",
        "Where is the wind blowing?",
        "Where is the wind blowing right now?"
      ],
      "responses": [
        "The wind in this area is currently blowing at {} mph, from the {}.",
        "The current wind speed in this area is {} mph, from the {}.",
        "Right now, the wind speed in this area is {} mph, from the {}.",
        "As of now, the wind speed here is at {} mph.\nMy records show the current direction from the {}.",
        "Records indicate wind speeds of up to {} mph, coming from the {}.",
        "My records indicate winds of up to {} mph, from the {}.",
        "Wind speeds are currently at around {} mph.\nWinds seem to be coming from the {}.",
        "Current wind speeds are approximately {} mph, coming from the {}.",
        "Wind Speed: {} mph.\nWind Direction: {}."
      ],
      "context": "wind current"
    },
    {
      "tag": "currentTemperature",
      "patterns": [
        "what is the temperature?",
        "Do i need a jacket?",
        "Do i need a jacket right now?",
        "Do i need a jacket currently?",
        "is it hot outside?",
        "is it cold outside?",
        "How hot is it rn?",
        "How cold is it rn?",
        "What's the temperature right now?",
        "How hot is it outside rn?",
        "Whats the temperature rn?",
        "what is the temperature like?",
        "what's the temperature right now?",
        "can you tell me what the temperature is?",
        "tell me how hot it is outside",
        "tell me how cold it is outside",
        "tell me what the temperature is like right now",
        "what's the outdoor temperature?",
        "what's the temperature outside?",
        "how hot is it outside?",
        "how cold is it outside?",
        "how hot is it",
        "how cold is it",
        "whats the current temperature?",
        "is it warm outside?",
        "is it chilly outside?",
        "how warm is it outside?",
        "how chilly is it outside?",
        "What's it like outside?",
        "can you give me an update on the temperature?",
        "update me on the temperature",
        "temperature check",
        "What's it like outside right now?",
        "temperature update",
        "what's the temperature reading?",
        "can you tell me the current temperature outside?",
        "what is the temperature looking like right now?",
        "how does the temperature feel currently?",
        "can you give me the temperature at this specific time?",
        "hows the temperature right now?",
        "can you give me an estimate on the current temperature?",
        "whats the temperature in this place?",
        "whats the temperature for this place?",
        "whats the temp like currently?",
        "What's the temperature like on a scale from 'polar vortex' to 'tropical paradise'?",
        "Can you give me the temperature in 'I need an extra blanket' or 'I need to break out the sunscreen' degrees?",
        "Can you tell me the temperature in 'I need a hot cocoa' or 'I need a cold beer' degrees?",
        "How hot/cold is it outside on a 'I need my parka' to 'I need my flip flops' scale?",
        "Can you give me the temperature in 'I need my AC' or 'I need my heater' degrees?",
        "What's the temperature like in 'I need my heavy coat' or 'I need my tank top' degrees?",
        "Can you tell me the temperature in 'I need my snow boots' or 'I need my sandals' degrees?",
        "How warm/cold is it outside on a 'I need my sweater' to 'I need my tank top' scale?",
        "Can you give me the temperature in 'I need my scarf' or 'I need my sunglasses' degrees?",
        "Can you give me the temperature in 'I need my mittens' or 'I need my flip flops' degrees?",
        "Can you tell me the temperature in 'I need my hoodie' or 'I need my sunglasses' degrees?",
        "How warm/cold is it outside on a 'I need my sweater' to 'I need my sunhat' scale?",
        "Can you give me the temperature in 'I need my boots' or 'I need my sandals' degrees?",
        "How hot/cold is it outside on a 'I need my winter coat' to 'I need my swimsuit' scale?",
        "Can you give me the temperature in 'I need my wool socks' or 'I need my flip flops' degrees?",
        "Can you tell me the current temperature?",
        "Can you give me the current temperature?",
        "Can you tell me what the temperature is right now?",
        "What's the temperature at the moment?",
        "Can you give me an update on the current temperature?",
        "What's the temperature like currently?",
        "Can you tell me the temperature right now?",
        "Can you give me the current temperature reading?",
        "Can you tell me the temperature update?",
        "What's the current temperature situation?",
        "Can you give me the temperature forecast for the current time?",
        "Can you tell me the current outdoor temperature?",
        "What's the temperature currently?",
        "Can you give me the temperature in my location right now?",
        "What's the temperature like at the moment in my area?",
        "What's the temperature like now?",
        "Can you tell me the temperature now?",
        "What's the current temperature forecast?",
        "Can you give me the temperature reading right now?",
        "Can you tell me the temperature right at this moment?",
        "What's the temperature like currently in my region?",
        "Can you give me the current temperature for this zip code?",
        "What's the temperature like right now in my location?",
        "Can you tell me the temperature at the current time?",
        "What's the current temperature looking like?",
        "Can you give me the current temperature for this place?",
        "Is it hot or cold outside currently?",
        "Is it warm or cold outside?",
        "Is it hot or cold outside?",
        "Is it warm or cold?",
        "Is it hot or cold?",
        "Is it hot or cold outside rn?",
        "Is it warm or cold outside rn?",
        "Is it hot or cold outside rn?",
        "Is it warm or cold rn?",
        "Is it hot or cold rn?",
        "Is it warm or cold outside right now?",
        "Is it hot or cold outside right now?",
        "Is it warm or cold right now?",
        "What's the current temperature situation?",
        "How does it feel outside?",
        "give me a temp reading",
        "whats the temperature of the surrounding area?",
        "whats this location's temperature",
        "what's the temperature of this location?",
        "what's the temperature of this place?",
        "what's the temperature of this area?",
        "whats the temperature of this city?",
        "whats the temperature of this town?",
        "how chilly is it?",
        "how warm is it?",
        "What is the temperature reading",
        "What's the temperature update",
        "tell me the temperature",
        "give me the temperature",
        "tell me the temperature update",
        "tell me the temperature for this area",
        "give me the temperature for this area",
        "Do I need to wear a jacket outside right now?",
        "What's the temperature like right now? Should I grab a jacket?",
        "Is it too chilly outside for me to go without a jacket right now?",
        "Is it warm enough to go without a jacket?",
        "Do I need a jacket for the current conditions?",
        "Is it too chilly to go outside without a jacket?"
      ],
      "responses": [
        "It is {}°F in this area.\n It currently feels like {}°F.",
        "The current temperature in this area is {}°F.\n Records indicate that it currently feels like {}°F.",
        "This area is currently showing {}°F temperatures.\n Currently, it feels like {} degrees.",
        "Currently, it is {}°F in this area.\n You may percieve this as {} degrees.",
        "The temperature in this area is currently {}°F, and feels like {}°F.",
        "The temperature in this area is {}°F, and feels like {}°F.",
        "Current: {}°F\nFeels Like: {}°F"
      ],
      "context": "temp current"
    },
    {
      "tag": "currentWeather",
      "patterns": [
        "What's the weather like outside?",
        "What's the weather like?",
        "What's the weather like rn?",
        "What is the weather rn?",
        "What is the weather like rn?",
        "What is it like outside?",
        "Can you give me a current weather summary?",
        "Can you give me a weather report?",
        "Current weather",
        "Give me a current weather report",
        "Can you tell me what the weather is like right now?",
        "Can you tell me what the weather is like?",
        "Current weather status",
        "What is it like outside right now?",
        "What is it like outside currently?",
        "What is the weather like currently?",
        "What is it currently like outside?",
        "What's the weather like currently?",
        "Can you tell me about the current weather?",
        "What's the current weather situation?",
        "What's the weather like right now?",
        "What's the current climate?",
        "What's the current atmospheric condition?",
        "How's the weather right now?",
        "What's the weather status currently?",
        "What's the current weather outlook?",
        "Is it sunny outside right now?",
        "What's the current temperature outside?",
        "What's the current weather prediction?",
        "What's the current climate like?",
        "Can you give me an update on the current weather?",
        "What's the current weather report?",
        "What's the current forecast?",
        "What's the current weather condition?",
        "What's the current weather situation like?",
        "What's the current weather status?",
        "Can you describe the current weather?",
        "What's the current weather outlook like?",
        "What's the current weather situation at the moment?",
        "What's the current weather forecast?",
        "How's the climate right now?",
        "What's the current atmospheric situation?",
        "What's the current temperature reading?",
        "What's the current weather report like?",
        "What's the current weather prediction for the area?",
        "What's the current weather status at the location?",
        "What's the current weather like outside?",
        "What's the current weather condition at the moment?",
        "Can you give me a weather update for right now?",
        "What's the current weather forecast for the location?",
        "What's the current weather situation in the vicinity?",
        "What's the weather outlook currently?",
        "What's the climate situation right now?",
        "What's the weather forecast currently?",
        "What's the current weather update?",
        "What's the current atmospheric condition in the area?",
        "What's the current climate status?",
        "What's the current weather prediction for the surroundings?",
        "What's the current weather situation in the region?",
        "What's the current weather status at the moment?",
        "What's the current weather update like?",
        "What's the weather outlook like at present?",
        "What's the current weather condition in the surroundings?",
        "What's the current atmospheric status?",
        "What's the current climate condition?",
        "What's the current weather prediction for the district?",
        "What's the current weather report for the location?",
        "What's the current weather situation in the district?",
        "What's the current weather status like?",
        "How's the weather looking at the moment?",
        "What's the current climate situation?",
        "What's the current atmospheric forecast?",
        "What's the current weather update like?",
        "What's the current weather outlook for the region?",
        "What's the current temperature reading right now?",
        "What's the weather status at the present time?",
        "What's the weather condition like at the location currently?",
        "Can you provide a weather report for the area at the moment?",
        "Can you give me a weather update?",
        "Give me a weather update"
      ],
      "responses": [
        "Here is a current weather forecast:\nCurrent temperature: {}°F.\nUV Index: {}.\n\nCurrent wind speed: {} mph., from the {}.\nCloud coverage: {}%.",
        "Here is a current weather report:\nCurrent temperature: {}°F.\nUV Index: {}.\n\nCurrent wind speed: {} mph., from the {}.\nCloud coverage: {}%.",
        "I've gathered some data for a current weather report:\nCurrent temperature: {}°F.\nUV Index: {}.\n\nCurrent wind speed: {} mph., from the {}.\nCloud coverage: {}%.",
        "Current weather:\nCurrent temperature: {}°F.\nUV Index: {}.\n\nCurrent wind speed: {} mph., from the {}.\nCloud coverage: {}%.",
        "I've created a weather report with some current data:\nCurrent temperature: {}°F.\nUV Index: {}.\n\nCurrent wind speed: {} mph., from the {}.\nCloud coverage: {}%.",
        "I've gathered some current weather data. Here you go, sir.\nCurrent temperature: {}°F.\nUV Index: {}.\n\nCurrent wind speed: {} mph., from the {}.\nCloud coverage: {}%."
      ],
      "context": "weather current"
    },
    {
      "tag": "options",
      "patterns": [
        "What can you perform?",
        "What can you do?",
        "What do you do?",
        "What tasks can you perform?",
        "What functions can you do?",
        "Tell me what you can do",
        "What else can you do?",
        "What other questions can I ask you?",
        "Tell me what else you can do",
        "What other things can I ask you?",
        "What else can I ask you?",
        "Tell me what else I can ask you",
        "What other things do you do?",
        "Tell me what other things you can do",
        "What other questions can you answer?",
        "Tell me what other questions you can answer",
        "Tell me what other questions I can ask you",
        "What are some other questions that I can ask you",
        "What are some other things that you can do?",
        "Tell me some other things that you are able to do",
        "What are some other prompts that I can ask you?",
        "What else can you tell me?"
      ],
      "responses": [
        "I can gather weekly, daily, and current weather data, sir.",
        "I can gather weather data for the humidity, temperature, wind speed, and more.",
        "Ask me about the weather, sir.",
        "I was trained to answer questions about the weather, but I can also answer many other questions.",
        "I can tell you about the weather...\nOr anything else, really.",
        "I have access to current, daily, and even weekly weather data.\nI can also answer other questions using my secondary neural network.",
        "It's quite simple, sir.\nPrimary Network: Weather.\nSecondary Network: Anything else."
      ]
    },
    {
      "tag": "currentRain",
      "patterns": [
        "Is it raining outside?",
        "Hey, is it currently raining?",
        "Can you tell me if it's raining?",
        "Do you know if it's raining outside?",
        "Is it raining right now?",
        "Is it currently raining?",
        "Is there rain outside?",
        "Is it wet outside?",
        "Is there rain outside right now?",
        "Is it wet outside right now?",
        "Are we getting any rain outside?",
        "Has it started to rain outside?",
        "Is the rain falling outside?",
        "Is there rain right now?",
        "Is there precipitation right now?",
        "Is there rain currently?",
        "Is there precipitation currently?",
        "Is there currently rain?",
        "Is there currently precipitation?",
        "Are we getting any precipitation right now?",
        "Are we getting any precipitation outside?",
        "Is it raining outside right now?",
        "Is it currently raining outside?",
        "Is there precipitation currently?",
        "Is there precipitation outside currently?",
        "Can you tell me if it's raining outside right now?",
        "Is it currently raining outside?",
        "Is that rain I hear?",
        "It's not raining, is it?",
        "Is it raining?",
        "Is that precipitation I hear?",
        "It's not raining right now, is it?",
        "Is it wet outside currently?",
        "Is it rainy outside?",
        "That's not rain I hear, is it?",
        "That's not precipitation I hear, is it?",
        "Is it rainy currently?",
        "Is it currently rainy?",
        "Is it rainy outside currently?",
        "Is it currently rainy outside?",
        "Is there any rain outside right now?",
        "Is there currently any rain outside?",
        "Is there currently any rain?",
        "Is there any rain outside currently?",
        "Is there any precipitation outside right now?",
        "Is there a rain forecast right now?",
        "Is there a rain forecast currently?",
        "Is there currently a rain forecast?",
        "Is it raining right now?",
        "Do you know if its raining outside?",
        "Do you know if its raining outside currently?",
        "Do you know if there's any rain outside right now?",
        "Is there any rain out?",
        "Is there any precipitation out?",
        "Can you tell me if it's raining currently?",
        "What is the current rain forecast?",
        "What is the current rain report?",
        "How is the current rain?",
        "What is the current precipitation forecast?",
        "Is there a current rain report?",
        "Is there a current rain forecast?",
        "Is there rain?",
        "Is that rain?",
        "Is there precipitation?",
        "Is that precipitation?",
        "Is it raining?",
        "Is it raining currently?",
        "Is there a rain forecast for right now?",
        "Is there a rain forecast currently?"
      ],
      "responses": [
        [
          "It is currently raining. The forecast is {}.",
          "There is currently {}, sir.",
          "Records currently indicate {}.",
          "My records currently indicate that there is currently {}.",
          "Currently, {}."
        ],
        [
          "It is not currently raining, sir.",
          "My records indicate no rain.",
          "Records indicate no rain in this area.",
          "There is no rain currently.",
          "It is not currently raining in this area",
          "There is currently no rain, sir."
        ]
      ],
      "context": "rain current"
    },
    {
      "tag": "rainWeek",
      "patterns": [
        "When should I expect the rain to start?",
        "Will it be raining anytime soon?",
        "When is the next rainstorm coming?",
        "What's the likelihood of rain in the near future?",
        "Can you predict when it's going to rain?",
        "When will the next rainfall occur?",
        "When's the next time that it will rain?",
        "When is the next time that it will rain?",
        "Can you give me an estimate of when it will start raining?",
        "When is the next rainy period expected?",
        "Are there any chances of rain in the coming hours?",
        "Can you tell me when the rain will start falling?",
        "When should I expect the rain to arrive?",
        "What's the expected time for the rain to start?",
        "Is it going to rain soon?",
        "When is the next day that it's gonna rain?",
        "When is the next chance of precipitation?",
        "Is there rain expected within the next day?",
        "Will it rain within the next day?",
        "Is there expected rain within the next day?",
        "What's the rain situation looking like?",
        "Can you give me an idea of when it's going to start raining?",
        "When is the next chance of rain?",
        "What's the chance of rain in the next 24 hours?",
        "Do you know how much it's gonna rain this week?",
        "What's the forecast for rainfall this week?",
        "Will it be raining a lot this week?",
        "How much rain can we expect this week?",
        "Is there a chance of rain this week?",
        "When's it gonna rain next?",
        "When is it gonna rain next?",
        "Are we expecting any rain this week?",
        "What's the precipitation outlook for this week?",
        "Can you tell me how much it's going to rain this week?",
        "How wet is it going to be this week?",
        "What's the chance of precipitation for this week?",
        "Will we have any rainy days this week?",
        "How much rainfall should we expect this week?",
        "What's the rain forecast for this week?",
        "Are we looking at any significant rainfall this week?",
        "Will this week be wet or dry?",
        "What's the expected amount of rainfall for this week?",
        "Can you tell me the expected precipitation for this week?",
        "What's the rainfall prediction for this week?",
        "Is there a lot of rain expected for this week?",
        "How much rain is expected for this week?",
        "Will it be a rainy week or a dry week?",
        "What's the chance of rain on any given day this week?",
        "Can you tell me about the rainfall pattern for this week?",
        "What's the precipitation rate for this week?",
        "How many rainy days are we expecting this week?",
        "What's the weather outlook for rainfall this week?",
        "Is there any heavy rain expected this week?",
        "What's the likelihood of rain this week?",
        "What's the anticipated rainfall for this week?",
        "Can you give me an estimate of how much it's going to rain this week?",
        "How much is it gonna rain in the next 24 hours?",
        "How much is it gonna rain in the next  days?",
        "How much rain will there be in the next  days?",
        "How much will it rain in the next  days?",
        "How much is it gonna rain next week?",
        "How much precipitation will there be next week?",
        "How much rain are we gonna get?",
        "How much is it gonna rain?",
        "How much rain is there gonna be this week?",
        "How much is it gonna rain this week?",
        "How much is it gonna rain in the next  days?",
        "Am i gonna need a jacket this week?",
        "Do i need a jacket this week?",
        "Am I gonna need a jacket this week?",
        "Will i need a jacket this week?",
        "Will i need to wear a jacket at all this week?",
        "When's the next rain?",
        "When is the next time that it's gonna rain?"
      ],
      "responses": [
        [
          "Today, there is a chance of rain expected rain at:",
          "It is currently expected to rain today at:",
          "Records indicate a chance of rain at:"
        ],
        [
          "There is no expected rain today.",
          "There is no rain expected today, sir.",
          "My records show no chance of rain today, sir.",
          "Records indicate no chance of rain today, sir."
        ],
        [
          "\n \nHere is a rain forecast for the rest of the week:",
          "\n \nI've gathered a weekly forecast for rain:",
          "\n \n I've created a weekly rain forecast, sir.",
          "\n \n Here is a rain forecast for the next 7 days."
        ],
        [
          "There is no rain expected within the next 7 days.",
          "According to my records, there is no expected precipitation in the next 7 days.",
          "I looked into the forecast for the next 7 days, and there doesn't seem to be any expected rain.",
          "According to my weekly forecast, there is no rain expected.",
          "There is no expected precipitation for the next 7 days.",
          "I do not see any expected preciptation forecast for the next 7 days."
        ]
      ],
      "context": "rain week"
    },
    {
      "tag": "dailySunset",
      "patterns": [
        "When will the sun set today?",
        "what time will the sun set?",
        "What time will the sun go down today?",
        "What time is sunset for the current day?",
        "When does the sun set today?",
        "When is the sun going down?",
        "What time is the sun setting?",
        "When will the sun set tonight?",
        "What is today's sunset time?",
        "When is today's sunset?",
        "What is the sunset time?",
        "What's the time of sunset?",
        "Do you know the time of sunset?",
        "What is the sunset time for today?",
        "Could you tell me what the sunset time is?",
        "What is the sun set time",
        "Can you tell me when the sun will set today?",
        "What is the scheduled time for sunset today?",
        "What is the approximate time for sunset today?",
        "Can you give me the time for when the sun will set today?",
        "What time can I expect the sun to set today?",
        "What is the sun's scheduled time of setting today?",
        "What time will the sun bid us farewell for the day?",
        "When can I catch the sunset today?",
        "What time will the day officially be over (in terms of sunlight)?",
        "What is the exact time of sunset for today?",
        "Can you provide me with the sunset time for the current day?",
        "What is the predicted time of sunset for today?",
        "What time does the sun set according to today's schedule?",
        "When does the day officially end (in terms of sunlight)?",
        "What is the estimated time for sunset today?",
        "Can you give me an idea of when the sun will set today?",
        "At what time can we say goodbye to the sun for the day?",
        "What time will the sun dip below the horizon today?",
        "What is today's scheduled sunset time?",
        "When can we expect the sun to set today?",
        "What is the calculated time of sunset for today?",
        "What time will the sun set according to current calculations?",
        "What is the planned time of sunset for the current day?",
        "When should we expect the sun to set today?",
        "What is the set time of sunset for the present day?",
        "What is the designated time of sunset for today?",
        "What time will the sun bid us adieu for the day?",
        "When will the daylight officially be over for today?",
        "What time will the sun say goodbye for the day?",
        "When will the sun take its leave for today?",
        "What is the intended time of sunset for today?",
        "What time will the sun depart for the day?",
        "When will the sun end its daily visit today?",
        "What time will the sun complete its daily journey today?",
        "What time will the sun complete its daily trek today?",
        "What time will the sun complete its daily voyage today?",
        "When will the sun bid us farewell?",
        "When will the stars come out?",
        "When will the moon take over?",
        "what time will the sun set?",
        "When will the day's end arrive?",
        "What is the expected sun set time?",
        "What is today's sunset time?",
        "What's the sunset time?",
        "Can you tell me what today's sunset time is?",
        "When is the sun gonna set?",
        "When is the sun gonna set tonight?",
        "When is the sun setting tonight?",
        "When is the sun gonna set today?",
        "When is the sunset time?",
        "What time is the sunset?",
        "Can you tell me the sunset time for today?"
      ],
      "responses": [
        "The sun will set today at {}pm.",
        "Today's sunset is at {}pm.",
        "The time of today's sunset is at {}pm.",
        "Today, the sunset time is {}pm.",
        "The sun will set today at about {}pm.",
        "{} pm.",
        "The sun will set today at approximately {}pm."
      ]
    },
    {
      "tag": "dailySunrise",
      "patterns": [
        "What's the sunrise time?",
        "What is the sunrise time?",
        "What time is the sunrise tomorrow?",
        "When does the sun come up tomorrow?",
        "When is the next sunrise?",
        "What time will the sun rise tomorrow?",
        "When will the sun rise tomorrow?",
        "What time will the sunrise be?",
        "When will the sunrise occur tomorrow?",
        "What time can I expect the sunrise tomorrow?",
        "When can I expect the sun to rise tomorrow?",
        "What time does the sun come up?",
        "When does the sunrise happen tomorrow?",
        "At what time will the sun rise tomorrow?",
        "When will the next sunrise occur?",
        "What is the sunrise time tomorrow?",
        "When will the sun be up tomorrow?",
        "What time does the sun rise tomorrow?",
        "When is the sun going to rise tomorrow?",
        "What time is the next sunrise?",
        "When can I see the sunrise tomorrow?",
        "When is the sun going to come up tomorrow?",
        "What time will the sun come up?",
        "When does the sun rise?",
        "What time does the sunrise happen?",
        "When will the sun rise?",
        "What time can I see the sunrise?",
        "When is the next time the sun will rise?",
        "What is the time of the sunrise?",
        "When is the next sunrise happening?",
        "What time will the sun be visible?",
        "When can I watch the sunrise tomorrow?",
        "What time is sunrise?",
        "When will the sun be rising tomorrow?",
        "What time is the sunrise?",
        "When is sunrise tomorrow?",
        "What time will the sun be rising?",
        "When can I see the beautiful sunrise tomorrow?",
        "What time will the sun be coming up?",
        "When does the sun come up?",
        "What time is the sun going to come up?",
        "When is the next sun rising?",
        "What time can I watch the sunrise?",
        "When will the sunrise be tomorrow?",
        "What time is the sun going to rise?",
        "When is the next time I can see the sunrise?",
        "What time will the sun come out?",
        "When can I see the sun rise tomorrow?",
        "What time does the sun appear?",
        "When does the sun show up?",
        "What time will the sun show up?",
        "When is the next sunrise going to be?",
        "What time can I expect to see the sunrise?",
        "When is the sun rising?",
        "What time is the sun rising?",
        "When will I see the sunrise?",
        "What time will the sunrise start?",
        "When is the next time the sun will be up?",
        "What time is the sun appearing?",
        "When does the sun appear?",
        "What time is the sunrise in the morning?",
        "When will the sun be visible tomorrow?",
        "What time can I see the sun rising?",
        "When is the next sunrise coming?",
        "What time is the next sunrise tomorrow?",
        "When will the sun be up?",
        "What time is the sun up?",
        "Can you tell me what time the sun will rise?",
        "Do you know the time that the sun will come up tomorrow?",
        "Can you tell me the sun rise time?",
        "What time is the sun visible?",
        "When can I see the sunrise in the sky?",
        "When will the sun appear tomorrow?",
        "What time will the sun be out?",
        "When is the next time the sun will appear?",
        "What time is the dawn tomorrow?",
        "When is the sun going to be up?",
        "What time is the sunrise scheduled for?",
        "When can I see the sunrise in my location?",
        "What time is the sunrise at my location?",
        "When will the sunrise happen in my location?",
        "What time will the sun come up in my location?",
        "When can I watch the sunrise at my location?",
        "What time does the sun rise in my area?",
        "When will the sun rise in my area?",
        "What's the sunrise time?",
        "What time will the sunrise be in my area?",
        "When can I see the sunrise in my area?",
        "What time is the sunrise at this location?",
        "When will the sunrise happen at this location?",
        "What time will the sun rise at this location?",
        "When can I see the sunrise at this location?",
        "What time is the sunrise today?",
        "When will the sun rise today?",
        "What time is the next sunrise today?",
        "When will the sun be up today?",
        "What time does the sun come up today?",
        "What time is the sunrise in my region?",
        "When will the sunrise happen in my region?",
        "What time will the sun come up in my region?",
        "When can I watch the sunrise in my region?",
        "What time does the sun rise in my region?",
        "When will the sun rise in my region?",
        "What time will the sunrise be in my region?",
        "When can I see the sunrise in my region?",
        "What time is the sun gonna rise tomorrow?",
        "What time is the sun rising tomorrow?",
        "At what time will the sun rise?"
      ],
      "responses": [
        "Today, the sun rose at {}am.\nTommorrow, the sun will rise at {}am.",
        "Today: {}am.\nTommorrow: {}am.",
        "Today's sunrise occured at {} am.\nTommorrow's sunrise will occur at {} am.",
        "Today, the sun rose at {}am.\nThe next sunrise will be at {}am.",
        "Today's sunrise: {}am.\nTomorrow's sunrise: {}am."
      ]
    },
    {
      "tag": "currentHumidity",
      "patterns": [
        "What's the current humidity?",
        "How humid is it right now?",
        "Can you tell me the humidity level?",
        "What's the humidity like?",
        "Is it humid outside?",
        "What's the current level of moisture in the air?",
        "How much moisture is in the air?",
        "Can you give me the current moisture level?",
        "What's the moisture level outside?",
        "How much moisture is there in the atmosphere?",
        "Can you tell me the current atmospheric moisture level?",
        "What's the current level of dampness?",
        "How damp is it currently?",
        "Can you give me the current level of wetness?",
        "What's the wetness level outside?",
        "How much moisture is there in the air right now?",
        "Can you tell me the level of dampness in the atmosphere?",
        "What's the dew point outside?",
        "How much moisture is there in the dew outside?",
        "What's the level of humidity in the air?",
        "How much humidity is there right now?",
        "Can you give me the current level of atmospheric humidity?",
        "What's the current level of moisture in the atmosphere?",
        "How much moisture is in the air outside?",
        "Can you tell me the current level of atmospheric moisture?",
        "What's the current moisture content?",
        "How much moisture is there right now?",
        "Can you give me the current moisture content?",
        "What's the current level of moisture in the air?",
        "How much moisture is in the air around me?",
        "Can you tell me the current moisture level around me?",
        "What's the current level of moisture in the environment?",
        "How much moisture is there in the environment right now?",
        "Can you give me the current environmental moisture level?",
        "What's the level of humidity inside?",
        "How much humidity is there indoors?",
        "Can you give me the current indoor humidity level?",
        "What's the current level of atmospheric moisture indoors?",
        "How much moisture is in the air indoors?",
        "Can you tell me the indoor moisture level?",
        "What's the current level of dampness indoors?",
        "How damp is it indoors?",
        "Can you give me the current level of indoor wetness?",
        "What's the indoor wetness level?",
        "How much moisture is there indoors?",
        "What's the current humidity level?",
        "What's the humidity like right now?",
        "How humid is it currently?",
        "Could you tell me the current level of humidity?",
        "What's the humidity at this moment?",
        "What's the current humidity percentage?",
        "How moist is it currently?",
        "What's the level of moisture in the air right now?",
        "What's the humidity reading now?",
        "What's the humidity measurement right now?",
        "What's the present humidity level?",
        "What's the humidity index right now?",
        "What's the level of atmospheric moisture right now?",
        "What's the present level of humidity?",
        "What's the humidity level currently?",
        "What's the humidity percentage at present?",
        "What's the moisture level at the moment?",
        "What's the current level of atmospheric moisture?",
        "What's the current level of water vapor in the atmosphere?",
        "What's the current level of air moisture?",
        "What's the current level of dampness in the environment?",
        "What's the current level of moisture in the environment?",
        "What's the current level of atmospheric dampness?",
        "What's the current level of humidity in the air around me?",
        "What's the current level of humidity in the surrounding atmosphere?",
        "What's the current level of moisture in the surrounding environment?",
        "What's the current level of water vapor in the surrounding air?",
        "What's the current level of dampness in the surrounding atmosphere?",
        "What's the current level of atmospheric moisture content in the surrounding environment?",
        "What's the current level of relative humidity in the surrounding atmosphere?",
        "What's the current level of moisture content in the surrounding environment?",
        "What's the current level of water in the surrounding air?",
        "What's the current level of moisture in the surrounding air?",
        "What's the current level of humidity in the environment around me?",
        "What's the current level of atmospheric moisture in the surrounding environment?",
        "What's the current level of water vapor in the environment around me?",
        "What's the current level of air moisture in the surrounding atmosphere?",
        "What's the current level of dampness in the environment around me?",
        "What's the current level of moisture in the surrounding atmosphere?",
        "What's the current level of atmospheric dampness in the environment around me?",
        "What's the current level of humidity in the air where I am?",
        "Do you know the current level of humidity?",
        "Can you tell me how humid it is right now?",
        "What is the current humidity percentage?",
        "Are you able to tell me the humidity level in this area?",
        "What is the current humidity level in this area?",
        "Can you tell me the humidity level right now?",
        "Do you know the humidity level at this moment?",
        "Tell me the current humidity level?",
        "How humid it is right now?",
        "Tell me the humidity?",
        "What's the humidity?",
        "What is the humidity like?",
        "Can you tell me about the humidity forecast?",
        "How is the humidity forecast?",
        "What is the humidity forecast like?",
        "What is the current humidity report?"
      ],
      "responses": [
        "The current humidity in this area is {}%.",
        "There is currently a humidity level of about {}%, sir.",
        "Current humidity levels are at about {}%",
        "My records show a humidity level of {} percent.",
        "There's currently {}% humidity in this area.",
        "{}%.",
        "Currently, {}%."
      ],
      "context": "humidity current"
    },
    {
      "tag": "currentPressure",
      "patterns": [
        "Are you able to give me an air pressure report for this area?",
        "What's the current air pressure?",
        "What's the air pressure like?",
        "Can you tell me the air pressure right now?",
        "I'm curious about the air pressure. What is it?",
        "What's the air pressure reading at the moment?",
        "Could you give me the current atmospheric pressure?",
        "What is the current atmospheric pressure measurement?",
        "Do you know what the air pressure is currently?",
        "What's the current barometric pressure?",
        "What's the current reading for the barometric pressure?",
        "Can you give me the barometric pressure reading?",
        "I'd like to know the current barometric pressure. What is it?",
        "What's the atmospheric pressure right now?",
        "Can you give me the current atmospheric pressure?",
        "I'm interested in knowing the current atmospheric pressure. What is it?",
        "What's the current pressure of the air?",
        "What's the air pressure right now?",
        "What's the air pressure like currently?",
        "Can you give me the current air pressure?",
        "I'm curious about the air pressure. What is it right now?",
        "What's the pressure of the air at the moment?",
        "What's the current reading for the air pressure?",
        "What's the current reading for the atmospheric pressure?",
        "What's the current reading for the barometric pressure?",
        "Can you tell me what the current atmospheric pressure is?",
        "I'd like to know the current reading for the atmospheric pressure. What is it?",
        "What's the current pressure measurement for the air?",
        "Can you give me the current barometric pressure reading?",
        "I'm curious about the atmospheric pressure. What is it right now?",
        "What's the current pressure of the atmosphere?",
        "What's the atmospheric pressure reading at the moment?",
        "Can you give me the current reading for the atmospheric pressure?",
        "I'd like to know the current reading for the barometric pressure. What is it?",
        "What's the current measurement for the atmospheric pressure?",
        "What's the current atmospheric pressure value?",
        "What's the current reading for the air pressure?",
        "What's the current air pressure value?",
        "What's the current barometric pressure value?",
        "Can you tell me what the air pressure is right now?",
        "I'm interested in knowing the current air pressure. What is it?",
        "What's the air pressure reading at the moment?",
        "What's the current pressure of the environment?",
        "What's the current reading for the pressure of the air?",
        "Can you give me the current reading for the air pressure?",
        "I'd like to know the current barometric pressure value. What is it?",
        "What's the current reading for the pressure of the atmosphere?",
        "What's the current pressure measurement for the atmosphere?",
        "Can you tell me what the current barometric pressure is?",
        "I'm curious about the current atmospheric pressure value. What is it?",
        "What's the current measurement for the barometric pressure?",
        "What's the current atmospheric pressure level?",
        "What's the current reading for the pressure of the environment?",
        "What's the current measurement for the air pressure?",
        "Can you give me the current atmospheric pressure value?",
        "I'd like to know the current reading for the pressure of the environment. What is it?",
        "What's the current barometric pressure level?",
        "What's the atmospheric pressure like right now?",
        "Can you give me the current pressure reading for the atmosphere?",
        "I'd like to know the current air pressure measurement. What is it?",
        "What's the current barometric reading for pressure?",
        "What is the current reading for atmospheric pressure?",
        "Can you tell me what the current pressure is?",
        "What's the current air pressure level?",
        "I'm curious about the current barometric pressure. What is it?",
        "What's the current reading for air pressure?",
        "What's the current atmospheric pressure reading?",
        "Can you give me the current barometric pressure measurement?",
        "I'd like to know the current reading for pressure. What is it?",
        "What's the air pressure like right now?",
        "What is the current atmospheric pressure value?",
        "Do you know what the air pressure is right now?",
        "Can you tell me what the air pressure reading is currently?",
        "Can you tell me the current reading for barometric pressure?",
        "What's the current pressure level?",
        "What's the current air pressure value?",
        "I'm interested in knowing the current atmospheric pressure level. What is it?",
        "What's the current pressure value?",
        "Can you give me the current atmospheric pressure reading?",
        "What's the current barometric pressure measurement?",
        "I'd like to know what the current reading is for atmospheric pressure.",
        "What's the pressure like at the moment?",
        "What is the current barometric pressure value?",
        "Can you tell me what the current air pressure measurement is?",
        "What's the current reading for atmospheric pressure like?",
        "What's the current reading for the pressure of the atmosphere?",
        "I'm curious about the current air pressure value. What is it?",
        "What's the current reading for the pressure of the air like?",
        "What's the current barometric pressure level?",
        "Can you give me the current air pressure level?",
        "What's the current reading for the atmospheric pressure level?",
        "What's the current atmospheric pressure level like?",
        "I'd like to know the current measurement for the pressure of the atmosphere. What is it?",
        "What's the current air pressure like at the moment?",
        "What is the current barometric pressure reading?",
        "Can you tell me the current atmospheric pressure level?",
        "What's the current reading for the air pressure level?",
        "What's the current barometric pressure like?",
        "What's the current atmospheric pressure measurement?",
        "I'm interested in knowing the current pressure reading. What is it?",
        "What's the current atmospheric pressure level reading?",
        "What's the current reading for the pressure of the atmosphere like?",
        "Can you give me the current atmospheric pressure level reading?",
        "What's the current air pressure level like at the moment?",
        "What's the current reading for the atmospheric pressure value?",
        "What's the current barometric pressure value like?",
        "I'd like to know the current measurement for the air pressure. What is it?",
        "What's the current reading for the atmospheric pressure level like?",
        "What's the current pressure reading like?"
      ],
      "responses": [
        "The current air pressure is about {} hPa, or {} inHg (inches of mercury).",
        "Records indicate a measured air pressure of about {} hPa ({} inHg).",
        "My records show an air pressure of {} hPa ({} inHg).",
        "{} hPa ({} inHg)."
      ],
      "context": "pressure current"
    },
    {
      "tag": "currentVisibility",
      "patterns": [
        "What's the current visibility like?",
        "What's the visibility like right now?",
        "What is the visibility like right now?",
        "What is the current visibility reading?",
        "How far can you see right now?",
        "What's the current distance you can see?",
        "What's the current visibility in meters?",
        "What's the visibility like outside?",
        "What is the current visibility level?",
        "How clear is it outside?",
        "What is the current visibility condition?",
        "What's the current level of visibility?",
        "What is the current visibility range?",
        "Can you tell me the visibility range in this area?",
        "Do you know what the visibility forecast is?",
        "How far can I see right now?",
        "What's the visibility for right now?",
        "What is the visibility range at the moment?",
        "What is the current level of atmospheric clarity?",
        "What is the current atmospheric transparency?",
        "How well can you see outside right now?",
        "What's the current state of visibility?",
        "What is the current atmospheric haze level?",
        "What's the current atmospheric visibility?",
        "What is the current atmospheric obscurity level?",
        "What is the current level of atmospheric clarity?",
        "What is the current state of atmospheric transparency?",
        "What is the current level of atmospheric haze?",
        "What's the current atmospheric obscurity?",
        "How good is the visibility outside right now?",
        "What's the current range of visibility?",
        "What is the current level of atmospheric fog?",
        "What is the current state of atmospheric clarity?",
        "What's the current atmospheric transparency level?",
        "How far can you see through the air right now?",
        "What's the current level of atmospheric obscurity?",
        "What is the current atmospheric visibility range?",
        "What's the current range of atmospheric visibility?",
        "What is the current atmospheric haze range?",
        "What is the current atmospheric clarity range?",
        "What's the current atmospheric obscurity range?",
        "What is the current atmospheric transparency range?",
        "How far is the visibility range right now?",
        "What is the current range of atmospheric clarity?",
        "What is the current range of atmospheric transparency?",
        "What is the current range of atmospheric obscurity?",
        "What's the current atmospheric visibility distance?",
        "What's the current atmospheric obscurity distance?",
        "What's the current atmospheric transparency distance?",
        "What's the current atmospheric haze distance?",
        "What's the current atmospheric clarity distance?",
        "How far can I see through the air right now?",
        "What is the current atmospheric visibility level?",
        "What is the current atmospheric obscurity level?",
        "What is the current atmospheric transparency level?",
        "What is the current atmospheric haze level?",
        "What is the current atmospheric clarity level?",
        "What's the distance you can see outside?",
        "What is the current atmospheric visibility distance?",
        "How many miles can you see right now?",
        "What's the current level of atmospheric clarity?",
        "What's the current atmospheric clarity rating?",
        "What's the current atmospheric obscurity rating?",
        "What is the current atmospheric haze rating?",
        "What's the current atmospheric transparency rating?",
        "How far can you see through the air?",
        "What's the current range of atmospheric haze?",
        "What's the current range of atmospheric obscurity?",
        "What's the current range of atmospheric transparency?",
        "What's the current range of atmospheric clarity?",
        "What is the current level of atmospheric mist?",
        "What is the current level of atmospheric smog?",
        "What is the current level of atmospheric smoke?",
        "What's the current atmospheric visibility condition?",
        "What is the current atmospheric fog level?",
        "What is the current atmospheric smog level?",
        "What is the current atmospheric smoke level?",
        "How clear is it outside right now?",
        "What's the current level of atmospheric pollution?",
        "What's the current atmospheric pollution rating?",
        "What's the current atmospheric visibility level in kilometers?",
        "What's the current atmospheric visibility level in miles?",
        "What's the current level of atmospheric visibility obstruction?",
        "What is the current atmospheric visibility distance in kilometers?",
        "What is the current atmospheric visibility distance in miles?",
        "How well can you see through the air?",
        "What's the current level of atmospheric haze?",
        "What's the current atmospheric visibility range in kilometers?",
        "What's the current visibility like?",
        "What's the visibility forecast right now?",
        "What is the current level of atmospheric smaze?",
        "What is the current level of atmospheric fume?",
        "Can you tell me the current visibility in this area?",
        "Do you know what the visibility is right now?",
        "Are you able to tell me what the visibility is?",
        "What is the current level of atmospheric dust?",
        "What's the current level of atmospheric opacity?",
        "What's the current level of atmospheric turbidity?",
        "What's the current atmospheric visibility distance in meters?",
        "What's the current atmospheric visibility level in meters?",
        "What is the current level of atmospheric particulate matter?",
        "What's the current level of atmospheric air quality?",
        "Are you able to give me a visibility report?"
      ],
      "responses": [
        "The current visibility in the surrounding area is approximately {} miles.",
        "The visibility in this area is currently {} miles.",
        "In this area, I can measure the visibility at about {} miles.",
        "In this area, you can currently see up to about {} miles.",
        "My records show a visibility range of up to {} miles.",
        "The current visibility in this area is approximately {} miles.",
        "Currently, the visibility in this area is about {} miles.",
        "Records indicate a current visibility range of up to {} miles."
      ],
      "context": "visibility current"
    },
    {
      "tag": "uviForecast",
      "patterns": [
        "What is the UV index on Monday?",
        "What's the UV index for Tuesday?",
        "Could you tell me the UV index for Wednesday?",
        "What's the UV index on Thursday?",
        "What's the UV index on Friday?",
        "What is the UV index for Monday?",
        "What's the UV index for Tuesday?",
        "What is the UV index on Wednesday?",
        "What will the uvi index be tomorrow?",
        "What's the UV index on Thursday?",
        "What's the UV index on Friday?",
        "What is the UV index going to be on Monday?",
        "What's the UV index going to be on Tuesday?",
        "What is the UV index going to be on Wednesday?",
        "What's the UV index going to be on Thursday?",
        "What's the UV index going to be on Friday?",
        "What is the UV index forecast for Monday?",
        "What's the UV index forecast for Tuesday?",
        "What is the UV index forecast for Wednesday?",
        "What's the UV index forecast for Thursday?",
        "What's the UV index forecast for Friday?",
        "What is the UV index prediction for Monday?",
        "What's the UV index prediction for Tuesday?",
        "What is the UV index prediction for Wednesday?",
        "What's the UV index prediction for Thursday?",
        "What's the UV index prediction for Friday?",
        "What is the UV index projected to be on Monday?",
        "What's the UV index projected to be on Tuesday?",
        "What is the UV index projected to be on Wednesday?",
        "What's the UV index projected to be on Thursday?",
        "What's the UV index projected to be on Friday?",
        "What is the UV index estimate for Monday?",
        "What's the UV index estimate for Tuesday?",
        "What is the UV index estimate for Wednesday?",
        "What's the UV index estimate for Thursday?",
        "What's the UV index estimate for Friday?",
        "What is the UV index level for Monday?",
        "What's the UV index level for Tuesday?",
        "What is the UV index level for Wednesday?",
        "What's the UV index level for Thursday?",
        "What's the UV index level for Friday?",
        "What is the UV index value for Monday?",
        "What's the UV index value for Tuesday?",
        "What is the UV index value for Wednesday?",
        "What's the UV index value for Thursday?",
        "What's the UV index value for Friday?",
        "What is the UV index score for Monday?",
        "What's the UV index score for Tuesday?",
        "What is the UV index score for Wednesday?",
        "What's the UV index score for Thursday?",
        "What's the UV index score for Friday?",
        "What is the UVI index on Monday?",
        "Can you tell me the UVI index for Tuesday?",
        "What is the UV index for Wednesday?",
        "What is the UVI index on Thursday?",
        "What's the UV index on Friday?",
        "Could you let me know the UV index for Saturday?",
        "What is the UVI index for Sunday?",
        "What is the UVI index on the coming Monday?",
        "Can you tell me the UV index for the upcoming Tuesday?",
        "What is the UV index for the next Wednesday?",
        "What is the UVI index on the following Thursday?",
        "What's the UV index on the succeeding Friday?",
        "Could you let me know the UV index for the next Saturday?",
        "What is the UVI index for the upcoming Sunday?",
        "What is the UVI index for tomorrow?",
        "What will the uvi be like tomorrow?",
        "What will the uvi index be like on thursday?",
        "What will the uvi index be like on wednesday?",
        "What will the uvi index be like on saturday?",
        "Can you tell me the UV index for the day after tomorrow?",
        "What does the uvi index look like for this thursday?",
        "What's the uvi index for tuesday?",
        "What is the forecasted uvi index for tomorrow?",
        "What is the uv index for tomorrow?",
        "what is tomorrow's uvi?",
        "What is the expected uvi index for next saturday?",
        "Could you tell me the uvi for saturday?",
        "What will the UV index be on Saturday?",
        "How strong will the UV rays be on Saturday?",
        "What is the expected UV index for Saturday?",
        "Can you tell me the UV index for Saturday?",
        "I'm planning an outdoor activity on Saturday, what will the UV index be?",
        "Will the UV index on Saturday be high?",
        "What is the level of this saturday's uvi?",
        "What is the level of this sunday's uvi?",
        "What's the UVI for the day?",
        "What's the UV index for the day?",
        "What is the UV report for today?",
        "Do you know what the UV report will be on tuesday?",
        "How's the UV index for the day?",
        "What is the UVI index for the day?",
        "Can you tell me the UV index for the day?",
        "What will the uvi index be for next saturday?",
        "What will the uvi be like for next saturday?",
        "What will the UV index be on Monday?",
        "Can you tell me the UV index for Tuesday?",
        "What's the UV index forecast for Wednesday?",
        "I'm curious about the UV index on Thursday, can you help?",
        "What can I expect the UV index to be on Friday?",
        "Could you give me the UV index prediction for Saturday?",
        "What's the expected UV index for Sunday?",
        "Will the UV index be high on Monday?",
        "Is the UV index supposed to be low on Tuesday?",
        "Can you tell me what the UV index will be like on Wednesday?",
        "What's the UVI index estimate for Thursday?",
        "Could you let me know the UV index projection for Friday?",
        "What's the anticipated UV index on Saturday?",
        "Can you predict the UV index for Sunday?",
        "I'm interested in the UV index for next Monday, do you know what it will be?",
        "Can you tell me the UV index for tomorrow?",
        "What's the UV index forecast for tomorrow?",
        "Are you able to tell me what the UV will be like on sunday?",
        "I'm curious about the UVI index tomorrow, can you help?",
        "What can I expect the UVI index to be tomorrow?",
        "Could you give me the UVI index prediction tomorrow?",
        "What's the expected UV index for tomorrow?",
        "Will the UVI index be high tomorrow?",
        "Is the UV index supposed to be low tomorrow?",
        "Can you tell me what the UV index will be like tomorrow?",
        "What's the UV index estimate for tomorrow?",
        "Could you let me know the UV index projection for tomorrow?",
        "What's the anticipated UVI index tomorrow?",
        "Can you predict the UVI index for tomorrow?",
        "Can you tell me the UV index for today?",
        "What does the uvi index look like today?",
        "What's the uvi index today?",
        "What is the uv index today?",
        "What is the UV forecast for the day?",
        "What will the UV index be like today?",
        "How strong will the UVI rays be today?",
        "What is the expected UVI index for today?",
        "Can you tell me the UVI index for today?"
      ],
      "responses": [
        "The UVI Index for {} ({}) is {}.",
        "{}'s ({}) UV index record is {}.",
        "My records indicate the UV index for {} ({}) at {}.",
        "The UV index for {} ({}) is expected to be about {}.",
        "The average UV index for {} ({}) is {}.",
        "{} ({}):\n UV Index: {}."
      ],
      "context": "uvi forecast"
    },
    {
      "tag": "windForecast",
      "patterns": [
        "What will the wind speed be on Monday?",
        "How strong will the wind be on Tuesday?",
        "What is the forecasted wind speed for Wednesday?",
        "What is the forecasted wind speed for the day?",
        "What is the wind forecast going to look like for the day?",
        "What is the wind speed on Thursday?",
        "What is the wind speed predicted for Friday?",
        "What will the wind speed be like on Saturday?",
        "What will the wind speed look like on Sunday?",
        "How fast will the wind be on Monday?",
        "What can I expect for wind speed on Tuesday?",
        "What will the wind speed be for Wednesday?",
        "What is the wind speed expected to be on Thursday?",
        "What will the wind speed be like on Friday?",
        "What will the wind speed be tomorrow?",
        "How strong is the wind predicted to be on Monday?",
        "What is the wind speed forecast for Tuesday?",
        "What will the wind speed be like on Wednesday?",
        "What is the wind speed estimated to be on Thursday?",
        "What is the wind speed expected for Friday?",
        "Do you know what the wind forecast for the day is like?",
        "How fast will the wind be on Saturday?",
        "What can I expect for wind speed on Sunday?",
        "What will the wind speed look like on Monday?",
        "What is the forecasted wind speed for Tuesday?",
        "What is the wind speed on Wednesday?",
        "What is the wind speed predicted for Thursday?",
        "What will the wind speed be like on Friday?",
        "What will the wind speed be tomorrow?",
        "How strong will the wind be on Monday?",
        "What can I expect for wind speed on Tuesday?",
        "What will the wind speed be for Wednesday?",
        "What is the wind speed expected to be on Thursday?",
        "What will the wind speed look like on Friday?",
        "How fast will the wind be tomorrow?",
        "What is the wind speed forecast for Monday?",
        "What will the wind speed be like on Tuesday?",
        "What is the wind forecast for the day?",
        "What is the wind speed estimated to be on Wednesday?",
        "What is the wind speed predicted for Thursday?",
        "What will the wind speed be for Friday?",
        "How strong is the wind expected to be on Saturday?",
        "What is the wind speed on Sunday?",
        "What will the wind speed look like on Monday?",
        "What is the forecasted wind speed for Tuesday?",
        "What will the wind speed be like on Wednesday?",
        "What is the wind speed expected to be on Thursday?",
        "What will the wind speed be like on Friday?",
        "What will the wind speed be tomorrow?",
        "How fast will the wind be on Monday?",
        "What can I expect for wind speed on Tuesday?",
        "What is the wind speed predicted for Wednesday?",
        "What is the wind speed expected for Thursday?",
        "What will the wind speed be like on Friday?",
        "What will the wind speed look like tomorrow?",
        "What will be the wind speed for tomorrow?",
        "Can you tell me the wind speed for Monday?",
        "How fast will the wind blow on Tuesday?",
        "What will the wind speed be like on Wednesday?",
        "What's the wind speed forecast for Thursday?",
        "How strong will the wind be on Friday?",
        "What's the wind speed outlook for Saturday?",
        "What's the wind velocity prediction for Sunday?",
        "Can you tell me the wind speed for next Monday?",
        "What will be the wind speed for next Tuesday?",
        "How fast will the wind blow next Wednesday?",
        "What will the wind speed be like next Thursday?",
        "What's the wind speed forecast for next Friday?",
        "How strong will the wind be next Saturday?",
        "What's the wind speed outlook for next Sunday?",
        "What's the wind velocity prediction for next Monday?",
        "Can you tell me the wind speed for next Tuesday?",
        "What will be the wind speed for next Wednesday?",
        "How fast will the wind blow next Thursday?",
        "What will the wind speed be like next Friday?",
        "What's the wind speed forecast for next Saturday?",
        "How strong will the wind be next Sunday?",
        "What's the wind speed outlook for next Monday?",
        "What's the wind velocity prediction for next Tuesday?",
        "Can you tell me the wind speed for next Wednesday?",
        "What will be the wind speed for next Thursday?",
        "How fast will the wind blow next Friday?",
        "What will the wind speed be like next Saturday?",
        "What's the wind speed forecast for next Sunday?",
        "How strong will the wind be next Monday?",
        "What's the wind speed outlook for next Tuesday?",
        "What's the wind velocity prediction for next Wednesday?",
        "Can you tell me the wind speed for next Thursday?",
        "What will be the wind speed for next Friday?",
        "How fast will the wind blow next Saturday?",
        "What will the wind speed be like next Sunday?",
        "What's the wind speed forecast for next Monday?",
        "How strong will the wind be next Tuesday?",
        "What's the wind speed outlook for next Wednesday?",
        "What's the wind velocity prediction for next Thursday?",
        "Can you tell me the wind speed for next Friday?",
        "What will be the wind speed for next Saturday?",
        "How fast will the wind blow next Sunday?",
        "What will the wind speed be like next Monday?",
        "What's the wind speed forecast for next Tuesday?",
        "How strong will the wind be next Wednesday?",
        "What's the wind speed outlook for next Thursday?",
        "What's the wind velocity prediction for next Friday?",
        "How fast will the wind blow this Monday?",
        "What's the wind speed forecast for this Tuesday?",
        "Can you tell me about the wind conditions this Wednesday?",
        "What will the wind speed be like this Thursday?",
        "Can you give me the wind speed prediction for this Friday?",
        "How strong will the wind be this Saturday?",
        "What's the wind speed forecast for this Sunday?",
        "Can you tell me about the wind conditions this Monday?",
        "What will the wind speed be like this Tuesday?",
        "Can you give me the wind speed prediction for this Wednesday?",
        "What will the wind speed be like today?",
        "What is the wind speed expected to be today?",
        "What will the wind speed be today?",
        "How fast will the wind be today?",
        "What can I expect for wind speed today?",
        "What is the wind gonna be like today?",
        "Do you know what the wind forecast is for this thursday?",
        "Could you tell me what the wind will be like on saturday?",
        "What is the wind going to be like tomorrow?",
        "What is the wind speed predicted for today?",
        "What is the wind speed expected for today?",
        "What will the wind speed look like today?",
        "What will be the wind speed for today?",
        "What is the expected wind speed for the day?",
        "What is the wind gonna be like for the day?",
        "What will the wind forecast be for the day?",
        "Can you tell me the wind speed for today?",
        "How fast will the wind blow today?"
      ],
      "responses": [
        "The wind forecast for {} ({}) is {} mph.",
        "My records for {} ({}) show wind speeds of up to {} mph.",
        "Wind speeds on {} ({}) are expected to average {} mph.",
        "The average wind speed for {} ({}) is {}.",
        "The wind forecast for {} ({}) is {} mph.",
        "Wind speeds for {} ({}) will average {} mph.",
        "{} ({}):\n Winds: {}mph."
      ],
      "context": "wind forecast"
    },
    {
      "tag": "rainForecast",
      "patterns": [
        "Will it rain on Monday?",
        "What's the rain forecast for Tuesday?",
        "Is there a chance of rain on Wednesday?",
        "What's the probability of rain on Thursday?",
        "Can you tell me about the chance of rain on Friday?",
        "Is there any rain expected on Saturday?",
        "What's the likelihood of rain on Sunday?",
        "Do you think it will rain on Monday?",
        "Is there a chance of rain on Tuesday?",
        "What's the forecast for rain on Wednesday?",
        "What's the probability of rain on Thursday?",
        "Can you tell me about the chance of rain on Friday?",
        "Is there any rain expected on Saturday?",
        "What is the rain gonna be like for the day?",
        "What's the rain like for the day?",
        "How is the rain for the day?",
        "What's the rain for the day?",
        "What is the rain forecast for the day?",
        "How is the precipitation for the day?",
        "What is the forecasted rain for the day?",
        "What's the likelihood of rain on Sunday?",
        "Will it rain tomorrow?",
        "What's the forecast for rain on Monday?",
        "Is there a chance of rain on Tuesday?",
        "How much rain are we gonna get today?",
        "What's the probability of rain on Wednesday?",
        "Can you tell me about the chance of rain on Thursday?",
        "Is there any rain expected on Friday?",
        "What's the likelihood of rain on Saturday?",
        "Do you think it will rain on Sunday?",
        "What is the precipitation for the day?",
        "What is the chance of rain for the day?",
        "Can you tell me the rain forecast for the day?",
        "What's the chance of rain tomorrow?",
        "What's the rain forecast for Monday?",
        "Is there any rain expected on Tuesday?",
        "What's the probability of rain on Wednesday?",
        "Can you tell me about the chance of rain on Thursday?",
        "Is there a chance of rain on Friday?",
        "What's the likelihood of rain on Saturday?",
        "Do you think it will rain on Sunday?",
        "What's the chance of rain on Monday?",
        "Is there any rain expected on Tuesday?",
        "What's the probability of rain on Wednesday?",
        "Can you tell me about the chance of rain on Thursday?",
        "Is there a chance of rain on Friday?",
        "What's the likelihood of rain on Saturday?",
        "Do you think it will rain on Sunday?",
        "What's the forecast for rain on Monday?",
        "Is there any rain expected on Tuesday?",
        "What's the probability of rain on Wednesday?",
        "Can you tell me about the chance of rain on Thursday?",
        "Is there a chance of rain on Friday?",
        "What's the likelihood of rain on Saturday?",
        "Do you think it will rain on Sunday?",
        "Will it rain tomorrow?",
        "Is it going to rain tomorrow?",
        "What's the chance of rain tomorrow?",
        "Do you expect any rain tomorrow?",
        "How likely is it to rain tomorrow?",
        "What's the forecast for rain tomorrow?",
        "Will there be rain tomorrow?",
        "How much is it gonna rain on friday?",
        "How much is it gonna rain on tuesday?",
        "How much is it gonna rain on wednesday?",
        "How much is it gonna rain this saturday?",
        "Can you tell me if it will rain tomorrow?",
        "Is it gonna rain today?",
        "Will it be rainy tomorrow?",
        "What's the possibility of rain tomorrow?",
        "Is there a chance of rain tomorrow?",
        "What's the likelihood of rain tomorrow?",
        "What's the probability of rain tomorrow?",
        "What's the expected rain for tomorrow?",
        "How much rain is expected tomorrow?",
        "Do you predict rain tomorrow?",
        "Will there be any rain tomorrow?",
        "Should I expect rain tomorrow?",
        "Do you anticipate any rain tomorrow?",
        "What's the rain situation like tomorrow?",
        "What's the status of rain tomorrow?",
        "What's the forecast for rain this Monday?",
        "Is it going to rain on next Tuesday?",
        "Will it rain on this Wednesday?",
        "What are the chances of rain next Thursday?",
        "Can I expect rain this Friday?",
        "How much rain will we get on wednesday?",
        "Will we get rain on tuesday?",
        "Will we get rain on thursday?",
        "How much rain will we get on friday?",
        "Will we get rain on saturday?",
        "How much rain will we get tomorrow?",
        "Will we get rain today?",
        "How much rain will we get on sunday?",
        "Is there a possibility of rain on next Saturday?",
        "How much rain is predicted for this Sunday?",
        "Will it be raining on next Monday?",
        "What's the expected rainfall this Tuesday?",
        "What are the chances of rain next Wednesday?",
        "Will it rain on this Thursday?",
        "Is there a possibility of rain next Friday?",
        "How much rain is predicted for this Saturday?",
        "Will it be raining on next Sunday?",
        "Is it going to rain this coming Monday?",
        "What's the forecast for next Tuesday's rain?",
        "Will it rain on this Wednesday or not?",
        "What are the chances of rain next Thursday or Friday?",
        "Can we expect any rain this Saturday?",
        "How much rain is predicted for next Sunday?",
        "How much will it rain on wednesday?",
        "How much will it rain on thursday?",
        "How much will it rain on sunday?",
        "How much will it rain on tuesday?",
        "Is it going to rain on monday?",
        "Is it going to rain on tuesday?",
        "Is it going to rain on wednesday?",
        "Is it going to rain on thursday?",
        "Is it going to rain on sunday?",
        "How much will it rain tomorrow?",
        "How much will it rain today?",
        "Is it going to rain tomorrow?",
        "Is it going to rain today?",
        "Will there be a rain forecast today?",
        "Will there be a rain forecast tomorrow?",
        "What is the rain forecast for tuesday?",
        "Is there any rain expected on wednesday?",
        "Will there be any rainfall on thursday?",
        "Could you tell me how much it rained today?",
        "What was the total rainfall for the current day?",
        "Can you provide the amount of rain for today?",
        "How much rain was there today?",
        "Could you give me the total rainfall for the current day?",
        "What was the rainfall recorded today?",
        "Can you inform me of the total rain for today?",
        "Can you give me the rain reading for today?",
        "Could you share the total rainfall for the current day?",
        "What is the forecast for rain for today?",
        "Can you tell me how much rain fell today?",
        "What's the total rainfall measured today?",
        "What's the total precipitation for today?",
        "How much rain was there today?",
        "Is it gonna rain today?",
        "Is it going to rain today?",
        "How much rain fell today?",
        "When is it raining today?",
        "When will it rain today?",
        "How much is it gonna rain on today?",
        "Do you anticipate any rain today?",
        "What's the rain situation like today?",
        "What's the status of rain today?",
        "What's the forecast for rain today?",
        "Is it going to rain today?",
        "What's today's rain?",
        "What is today's rain?",
        "Do you know if it's gonna rain today?",
        "What's today's rain forecast?",
        "Will it rain today?",
        "What are the chances of rain today?",
        "Can I expect rain today?",
        "Is it raining today?",
        "Is it raining tomorrow?",
        "Is it raining on monday?",
        "Is it raining next friday?",
        "Is it raining saturday?",
        "Is it raining next sunday?",
        "Did it rain today?",
        "Has it rained today?",
        "Has rain fell today?",
        "Did rain fall today?"
      ],
      "responses": [
        [
          "For {} ({}), there is a {}% chance for {} inches of rainfall.",
          "The chance of rain for {} ({}) is {}%, for {} inches.",
          "For {} ({}), there is a {}% chance and expected {} inches of rain.",
          "{} ({}):\n Chance of rain: {}%.\n Rainfall: {} inches."
        ],
        [
          "There is no rain expected on {} ({}).",
          "There is no chance of rain for {} ({}).",
          "The chance of rain for {} ({}) is 0%.",
          "There is no rain forecasted for {} ({}).",
          "{} ({}):\n Chance of rain: 0%.\n Rainfall: 0 inches."
        ]
      ],
      "context": "rain forecast"
    },
    {
      "tag": "highTempForecast",
      "patterns": [
        "What's the highest temperature on Monday?",
        "What's the maximum temperature on Tuesday?",
        "How high will the temperature get on Wednesday?",
        "What's the peak temperature on Thursday?",
        "What's the highest temperature today?",
        "How hot did it get today?",
        "How hot was it today?",
        "How warm did it get today?",
        "How warm was it today?",
        "What's the hottest it got today?",
        "What's the highest temperature for today?",
        "What's the top temperature on Friday?",
        "How hot is the weather gonna get next tuesday?",
        "How hot is the weather gonna get on saturday?",
        "What's the highest temperature predicted for Saturday?",
        "What's the peak temperature on Sunday?",
        "What's the highest temperature on Monday going to be?",
        "What's the high for the day?",
        "What is the high temperature for the day?",
        "What's the high temperature forecast for the day?",
        "How high is the temperature expected to be on Tuesday?",
        "What is the projected high temperature for Wednesday?",
        "What's the highest temperature for Thursday forecasted to be?",
        "What's the expected highest temperature on Friday?",
        "What is the highest temperature predicted for Saturday?",
        "What is the maximum temperature for Sunday?",
        "What's the highest temperature going to be on Monday?",
        "How high will the temperature get on Tuesday?",
        "What is the peak temperature for Wednesday?",
        "What's the top temperature on Thursday?",
        "What's the highest temperature on Friday?",
        "What is the peak temperature predicted for Saturday?",
        "What is the projected highest temperature for Sunday?",
        "What's the highest temperature expected for Monday?",
        "What is the expected high temperature for Tuesday?",
        "What's the highest temperature projected for Wednesday?",
        "How high is the temperature expected to be on Thursday?",
        "What is the highest temperature predicted for Friday?",
        "What's the maximum temperature for Saturday?",
        "What's the peak temperature for Sunday?",
        "What's the highest temperature for Monday going to be?",
        "What is the peak temperature predicted for Tuesday?",
        "What's the highest temperature for Wednesday forecasted to be?",
        "What's the projected highest temperature for Thursday?",
        "What is the highest temperature for Friday expected to be?",
        "What will the high be for the day?",
        "What is the high for the day?",
        "How hot is it for the day?",
        "How hot is it gonna get for the day?",
        "How is the high for the day?",
        "What's the highest temperature predicted for Saturday?",
        "What is the maximum temperature for Sunday expected to be?",
        "What's the highest temperature going to be on Monday?",
        "How high is the temperature expected to be on Tuesday?",
        "What is the peak temperature for Wednesday predicted to be?",
        "What's the top temperature on Thursday expected to be?",
        "What's the highest temperature for Friday going to be?",
        "What is the peak temperature predicted for Saturday?",
        "What's the projected high temperature for Sunday?",
        "What's the highest temperature expected for Monday?",
        "What is the expected high temperature for Tuesday?",
        "What's the highest temperature for Wednesday projected to be?",
        "How high is the temperature expected to be on Thursday?",
        "What is the highest temperature predicted for Friday?",
        "What's the maximum temperature for Saturday expected to be?",
        "What's the peak temperature for Sunday forecasted to be?",
        "What's the highest temperature on Monday predicted to be?",
        "What is the peak temperature for Tuesday expected to be?",
        "What's the projected high temperature for Wednesday?",
        "What is the top temperature for Thursday expected to be?",
        "What's the highest temperature for Friday projected to be?",
        "What is the highest temperature predicted for Saturday?",
        "What's the maximum temperature for Sunday?",
        "What's the high for tomorrow?",
        "What's the highest temperature for Monday?",
        "What's the highest temperature for Tuesday?",
        "What's the high for tomorrow's date?",
        "What's the high for next wednesday?",
        "What's the high for Wednesday?",
        "What is the high for Thursday?",
        "Do you know what the highest temperature for Friday is?",
        "What's the highest temperature for next Monday?",
        "What's the high for Saturday?",
        "What's the highest temperature for Sunday?",
        "Are you able to tell me the high for tomorrow's weather?",
        "What's the highest temperature for this Monday?",
        "What's the highest temperature for this Tuesday?",
        "What's the high for tomorrow's temperature?",
        "What's the high temperature for this tuesday?",
        "What's the high for this Wednesday?",
        "What's the high for this Thursday?",
        "What is the hottest temperature for this Friday?",
        "What's the highest temperature for next Tuesday?",
        "What's the high for this Saturday?",
        "What's the highest temperature for this Sunday?",
        "Cold you tell me what the highest temperature for tomorrow will be?",
        "What's the high for next Monday?",
        "What's the high for next Tuesday?",
        "What is the hottest temperature for tomorrow?",
        "What's the high for next Wednesday?",
        "What's the high for next Thursday?",
        "What's the highest temperature for next Friday?",
        "What's the highest temperature for this day's temperature?",
        "What's the high for the next day's weather?",
        "What's the highest temperature for the next day's temperature?",
        "What's the high for tomorrow's forecast?",
        "What's the highest temperature for the next day's forecast?",
        "What's the high for the next day?",
        "What's the highest temperature for the following Monday?",
        "What's the highest temperature for the day after tomorrow?",
        "What's the highest temperature for the following Tuesday?",
        "What's the high for tomorrow's temperature?",
        "What's the highest temperature for the following Wednesday?",
        "What will be the warmest temperature on Monday?",
        "How hot is it going to get on Tuesday?",
        "What's the highest temperature forecasted for Wednesday?",
        "What's the warmest temperature expected on Thursday?",
        "Can you tell me the peak temperature for Friday?",
        "How warm is it going to be on Saturday?",
        "What's the highest temperature forecasted for Sunday?",
        "What's the peak temperature on Monday?",
        "What is the maximum temperature on Tuesday?",
        "How hot will it get on Wednesday?",
        "What's the highest temperature predicted for Thursday?",
        "What's the warmest temperature expected on Friday?",
        "Can you tell me the maximum temperature for Saturday?",
        "What will be the peak temperature on Sunday?",
        "How warm will it get on Monday?",
        "What's the high for Sunday?",
        "What is the high for Monday?",
        "What's the highest temperature expected on Tuesday?",
        "What is the maximum temperature forecasted for Wednesday?",
        "How hot is it going to be on Thursday?",
        "What's the warmest temperature on Friday?",
        "Can you tell me the peak temperature for Saturday?",
        "Whats the high gonna be this monday?",
        "What is the high gonna be this tuesday?",
        "Whats the high gonna be on wednesday?",
        "What is the high gonna be on thursday?",
        "Whats the high gonna be on friday?",
        "What is the high gonna be next saturday?",
        "Whats the high gonna be next sunday?",
        "Whats the hottest temperature gonna be on wednesday?",
        "What is the hottest temperature gonna be on thursday?",
        "Whats the hottest its gonna be on friday?",
        "What is the hottest it's gonna be next saturday?",
        "How hot did it get today?",
        "How hot did the temperature get today?",
        "How warm did it get today?",
        "How hot is it gonna get today?",
        "How warm is it gonna get today?",
        "How hot is it getting today?",
        "How warm is it getting today?",
        "What's the hottest temperature gonna be today?",
        "What's the hottest it's gonna be today?",
        "What's the warmest it's gonna be today?",
        "How high is it gonna be for the day?",
        "What is the high gonna be for the day?",
        "How hot is it gonna get on monday?",
        "How high is it gonna get tomorrow?",
        "How high is it gonna get today?",
        "How hot will it get on tuesday?",
        "How hot is it gonna get on wednesday?",
        "How hot will it get on thursday?",
        "How hot is it gonna get on friday?",
        "How hot will it get on saturday?",
        "How hot is it going get on sunday?",
        "How hot will it get tomorrow?",
        "How hot is it gonna get today?",
        "How hot is it going to get tomorrow?"
      ],
      "responses": [
        [
          "The high for {} ({}) is {} degrees.",
          "The daily high for {} ({}) is {}°F.",
          "The high for {} ({}) is {}°F.",
          "{} ({}):\n High Temperature: {}°F.",
          "The high temperature forecast for {} ({}) is {}°F.",
          "{}'s ({}) high is {}°F.",
          "Temperatures on {} ({}) will get up to {}°F.",
          "Temperatures on {} ({}) are expected to get up to {}°F."
        ],
        [
          "My apologies, sir. I am only able to collect daily high temperature forecasts",
          "My apologies. I can only gather daily high temperature data."
        ]
      ],
      "context": "high forecast"
    },
    {
      "tag": "lowTempForecast",
      "patterns": [
        "What is the low temperature for today?",
        "What's the expected low for today?",
        "Could you tell me the low temperature for today?",
        "What is today's low temperature?",
        "What will be the low temperature today?",
        "What's the low temperature prediction for today?",
        "What's the low temperature going to be like today?",
        "What is the low temperature for tomorrow?",
        "What's the expected low for tomorrow?",
        "Could you tell me the low temperature for tomorrow?",
        "What's the low temperature forecast for the day?",
        "What's the low temperature for the day?",
        "What is tomorrow's low temperature?",
        "What will be the low temperature tomorrow?",
        "What's the low temperature prediction for tomorrow?",
        "What's the low temperature going to be like tomorrow?",
        "What is the low temperature for Monday?",
        "What's the expected low for Monday?",
        "Could you tell me the low temperature for Monday?",
        "What is Monday's low temperature?",
        "What will be the low temperature on Monday?",
        "What's the low temperature prediction for Monday?",
        "What's the low temperature going to be like on Monday?",
        "What is the low temperature for Tuesday?",
        "What is the low for the day?",
        "What is the low gonna be for the day?",
        "What is the low forecast for the day?",
        "What's the expected low for Tuesday?",
        "Could you tell me the low temperature for Tuesday?",
        "What is Tuesday's low temperature?",
        "What will be the low temperature on Tuesday?",
        "What's the low temperature prediction for Tuesday?",
        "What's the low temperature going to be like on Tuesday?",
        "What is the low temperature for Wednesday?",
        "What's the expected low for Wednesday?",
        "What's the lowest temperature for next sunday?",
        "Could you tell me the low temperature for Wednesday?",
        "What is Wednesday's low temperature?",
        "What will be the low temperature on Wednesday?",
        "What's the low temperature prediction for Wednesday?",
        "What's the low temperature going to be like on Wednesday?",
        "What is the low temperature for Thursday?",
        "What's the expected low for Thursday?",
        "Could you tell me the low temperature for Thursday?",
        "What is Thursday's low temperature?",
        "What will be the low temperature on Thursday?",
        "What's the low temperature prediction for Thursday?",
        "What's the low temperature going to be like on Thursday?",
        "What is the low temperature for Friday?",
        "What's the expected low for Friday?",
        "Could you tell me the low temperature for Friday?",
        "What is Friday's low temperature?",
        "How cold will it get on sunday?",
        "How cold will it get on friday?",
        "Wha's the lowest temperature for tuesday?",
        "What will be the low temperature on Friday?",
        "What's the low temperature prediction for Friday?",
        "What's the low temperature going to be like on Friday?",
        "What is the low temperature for Saturday?",
        "What's the expected low for Saturday?",
        "Could you tell me the low temperature for Saturday?",
        "What is Saturday's low temperature?",
        "What will be the low temperature on Saturday?",
        "What's the low temperature prediction for Saturday?",
        "What's the low temperature going to be like on Saturday?",
        "Can you tell me how cold its gonna get today?",
        "How chilly is it gonna get tomorrow?",
        "How cold is it gonna get on tuesday?",
        "What's the coldest it's gonna be on thursday?",
        "Whats the coldest its gonna be tomorrow?",
        "What's the chilliest it's gonna be on thursday?",
        "What's the coldest it will be this tuesday?",
        "What's the coldest it will be on wednesday?",
        "What is the coldest it is gonna get on thursday?",
        "What is the chilliest it is gonna get today?",
        "What is the lowest temperature we can expect today?",
        "What will the low temperature drop to today?",
        "What's the coldest it will be today?",
        "What is the minimum temperature for today?",
        "What is the expected minimum temperature today?",
        "What is the projected low for today?",
        "What's the chill factor today?",
        "What will be the lowest temperature tomorrow?",
        "What's the coldest it will be tomorrow?",
        "What is the minimum temperature for tomorrow?",
        "What is the expected minimum temperature tomorrow?",
        "What is the projected low for tomorrow?",
        "What's the chill factor tomorrow?",
        "How cold is it gonna get today?",
        "What's the coldest it's gonna get today?",
        "How cold is it gonna get tomorrow?",
        "What's the coldest it's gonna get tomorrow?",
        "How cold is it gonna get on monday?",
        "What's the coldest it's gonna get on tuesday?",
        "How cold is it gonna get on wednesday?",
        "What's the coldest for thursday?",
        "Would you be able to tell me how cold its gonna get on friday?",
        "How low is it gonna get tomorrow?",
        "How low is it gonna get today?",
        "What's the coldest temperature for saturday?",
        "How cold is it gonna get on sunday?",
        "What will be the lowest temperature on Monday?",
        "What's the coldest it will be on Monday?",
        "What is the minimum temperature for Monday?",
        "What is the expected minimum temperature on Monday?",
        "What is the projected low for Monday?",
        "What's the chill factor on Monday?",
        "What will be the lowest temperature on Tuesday?",
        "What's the coldest it will be on Tuesday?",
        "What is the forecasted minimum temperature for Tuesday?",
        "What is the expected minimum temperature on Tuesday?",
        "What is the projected low for Tuesday?",
        "What's the chill factor on Tuesday?",
        "What will be the lowest temperature on Wednesday?",
        "What's the coldest it will be on Wednesday?",
        "What is the minimum temperature for Wednesday?",
        "What is the expected minimum temperature on Wednesday?",
        "What is the projected low for Wednesday?",
        "What's the chill factor on Wednesday?",
        "What will be the lowest temperature on Thursday?",
        "What's the coldest it will be on Thursday?",
        "What is the low gonna be today?",
        "How cold will it get today?",
        "How cold will it get tomorrow?",
        "How cold will it get on monday?",
        "How low is it gonna get on wednesday?",
        "How low is it gonna get tomorrow?",
        "What is the minimum temperature for Thursday?",
        "What is the expected minimum temperature on Thursday?",
        "What is the projected low for Thursday?",
        "What's the chill factor on Thursday?",
        "What will be the lowest temperature on Friday?",
        "What's the coldest it will be on Friday?",
        "What is the minimum temperature for Friday?",
        "What is the expected minimum temperature on Friday?",
        "What is the projected low for Friday?",
        "What's the chill factor on Friday?",
        "What will be the lowest temperature on Saturday?",
        "What's the coldest it will be on Saturday?",
        "What is the minimum temperature for Saturday?",
        "What is the expected minimum temperature on Saturday?",
        "What is the projected low for Saturday?",
        "What's the chill factor on Saturday?",
        "How cold is it gonna get on tuesday?",
        "How cold is it gonna get tomorrow?"
      ],
      "responses": [
        [
          "The low for {} ({}) is {} degrees.",
          "The daily low for {} ({}) is {}°F.",
          "The low for {} ({}) is {}°F.",
          "{} ({}):\n Low Temperature: {}°F.",
          "The low temperature forecast for {} ({}) is {}°F.",
          "{}'s ({}) low is {}°F.",
          "Temperatures on {} ({}) will get down to {}°F.",
          "Temperatures on {} ({}) are expected to get down to {}°F."
        ],
        [
          "My apologies. I can only gather daily low temperature forecast.",
          "Sorry, sir. For low temperature, I can only gather daily forecasts."
        ]
      ],
      "context": "low forecast"
    },
    {
      "tag": "weatherForecast",
      "patterns": [
        "What's the weather forecast for today?",
        "What will the weather be like today?",
        "What kind of weather can we expect today?",
        "What's the weather report for today?",
        "How will the weather be today?",
        "What are the weather conditions for today?",
        "What's the outlook for the weather today?",
        "What's the forecast for tomorrow's weather?",
        "What's the weather like for sunday?",
        "What's the weather like for wednesday?",
        "What will the weather be like tomorrow?",
        "What kind of weather can we expect tomorrow?",
        "What's the weather report for tomorrow?",
        "What is the weather for the day?",
        "How is the weather for the day?",
        "What is the weather gonna be like for the day?",
        "How is the weather gonna be for the day?",
        "How is the weather for the day?",
        "What is the weather for the day?",
        "What's the weather gonna be like next tuesday?",
        "What is the weather going to be like next wednesday?",
        "What is the weather forecast for the day?",
        "How will the weather be tomorrow?",
        "What are the weather conditions for tomorrow?",
        "What's the outlook for the weather tomorrow?",
        "What's the weather forecast for Monday?",
        "What will the weather be like on Monday?",
        "What kind of weather can we expect on Monday?",
        "What's the weather report for Monday?",
        "What is the weather gonna be like on tuesday?",
        "How will the weather be on Monday?",
        "What are the weather conditions for Monday?",
        "What's the outlook for the weather on Monday?",
        "What's the weather forecast for Tuesday?",
        "What will the weather be like on Tuesday?",
        "What kind of weather can we expect on Tuesday?",
        "What's the weather report for Tuesday?",
        "How will the weather be on Tuesday?",
        "What are the weather conditions for Tuesday?",
        "What's the outlook for the weather on Tuesday?",
        "What's the weather forecast for Wednesday?",
        "What will the weather be like on Wednesday?",
        "What kind of weather can we expect on Wednesday?",
        "What's the weather report for Wednesday?",
        "How will the weather be on Wednesday?",
        "What are the weather conditions for Wednesday?",
        "What's the outlook for the weather on Wednesday?",
        "What's the weather forecast for Thursday?",
        "What will the weather be like on Thursday?",
        "What kind of weather can we expect on Thursday?",
        "What's the weather report for Thursday?",
        "How will the weather be on Thursday?",
        "What are the weather conditions for Thursday?",
        "What's the outlook for the weather on Thursday?",
        "What's the weather forecast for Friday?",
        "What will the weather be like on Friday?",
        "What kind of weather can we expect on Friday?",
        "What's the weather report for Friday?",
        "What is the weather report for the day?",
        "How is the weather looking for the day?",
        "How will the weather be on Friday?",
        "What are the weather conditions for Friday?",
        "What's the outlook for the weather on Friday?",
        "What's the weather forecast for Saturday?",
        "What will the weather be like on Saturday?",
        "What kind of weather can we expect on Saturday?",
        "What's the weather report for Saturday?",
        "How will the weather be on Saturday?",
        "What are the weather conditions for Saturday?",
        "What's the outlook for the weather on Saturday?",
        "What is the weather gonna be like tomorrow?",
        "Whats the weather gonna be like today?",
        "What is the weather gonna be like on tuesday?",
        "What's the forecast for today?",
        "What are the conditions like today?",
        "What's today's climate outlook?",
        "What can we expect for today's climate?",
        "What is the weather gonna be like for the day?",
        "What's the forecast for tomorrow's conditions?",
        "What are the conditions like tomorrow?",
        "What's tomorrow's climate outlook?",
        "What's the atmospheric condition tomorrow?",
        "What can we expect for tomorrow's climate?",
        "What's the forecast for Monday's conditions?",
        "What are the conditions like on Monday?",
        "What is it like outside today?",
        "What is it gonna be like outside on tuesday?",
        "What is it gonna be like outside tomorrow?",
        "What is it gonna be like out today?",
        "What's it like outside this sunday?",
        "What will it be like outside this sunday?",
        "What will it be like outside today?",
        "What will it be like out tomorrow?",
        "What is it gonna be like on thursday?",
        "What will the weather be like tomorrow?",
        "What is the weather like today?",
        "Whats the weather today?",
        "Can you give me a summary of the weather today?",
        "Tomorrow's weather",
        "Thursday's weather",
        "Weather forecast for today",
        "What's the weather gonna be like on sunday?",
        "What's the weather gonna be like on friday?",
        "Tomorrow's weather forecast",
        "Is it nice outside today?",
        "Can you tell me the weather forecast for the day?",
        "Is it gonna be nice outside on tuesday?",
        "Is it gonna be nice outside this sunday?",
        "Will it be nice outside tomorrow?",
        "Will it be better out this sunday?",
        "How is the weather going to look on sunday?",
        "How is the weather going to be on sunday?",
        "Is the weather on monday going to be nice?",
        "Is the weather on sunday going to be nice?",
        "What will the weather be like on sunday?",
        "Is the weather on sunday gonna be nice?"
      ],
      "responses": [
        "Here is a weather forecast for {} ({}):\nAverage temperature: {} degrees.\nLow: {} degrees.\nHigh: {} degrees.\n\nAverage wind speed: {} mph. with gusts up to {} mph.\nCloud coverage: {}%\nPrecipitation: {}% chance of {}",
        "I've created a weather forecast for {} ({}):\nAverage temperature: {} degrees.\nLow: {} degrees.\nHigh: {} degrees.\n\nAverage wind speed: {} mph. with gusts up to {} mph.\nCloud coverage: {}%\nPrecipitation: {}% chance of {}",
        "I've gathered some weather data for {} ({}):\nAverage temperature: {} degrees.\nLow: {} degrees.\nHigh: {} degrees.\n\nAverage wind speed: {} mph. with gusts up to {} mph.\nCloud coverage: {}%\nPrecipitation: {}% chance of {}",
        "Here's a weather report for {} ({}):\nAverage temperature: {} degrees.\nLow: {} degrees.\nHigh: {} degrees.\n\nAverage wind speed: {} mph. with gusts up to {} mph.\nCloud coverage: {}%\nPrecipitation: {}% chance of {}",
        "I've collected some data for {}'s ({}) weather report:\nAverage temperature: {} degrees.\nLow: {} degrees.\nHigh: {} degrees.\n\nAverage wind speed: {} mph. with gusts up to {} mph.\nCloud coverage: {}%\nPrecipitation: {}% chance of {}"
      ],
      "context": "weather forecast"
    },
    {
      "tag": "humidityForecast",
      "patterns": [
        "What's the humidity like for tomorrow?",
        "Can you give me the humidity level for Wednesday?",
        "What's the expected humidity for Thursday?",
        "How humid will it be on Friday?",
        "What's the humidity level for next monday?",
        "What's the humidity level for Saturday?",
        "What's the humidity forecast for Sunday?",
        "What's the projected humidity level for Wednesday?",
        "What's the expected humidity situation for Thursday?",
        "What's the forecasted humidity for Friday?",
        "What's the humidity outlook for Saturday?",
        "What's the humidity status for Sunday?",
        "What's the humidity like today?",
        "What's the humidity tomorrow?",
        "How humid will it be on Monday?",
        "What's the humidity on Tuesday?",
        "What's the humidity for Wednesday?",
        "What's the expected humidity for Thursday?",
        "What's the humidity on Friday?",
        "What's the humidity like on Saturday?",
        "What's the humidity level for Sunday?",
        "What's the humidity for Monday?",
        "What's the humidity for Tuesday?",
        "What's the humidity for Wednesday?",
        "What's the expected humidity for Thursday?",
        "What's the humidity for Friday?",
        "What's the humidity for Saturday?",
        "What will the humidity be for the day?",
        "How humid is it today?",
        "Can you tell me how humid it is today?",
        "What is the humidity level for the day?",
        "What's the humidity for the day like?",
        "Can you tell me the humidity for the day?",
        "What is the humidity gonna be like for the day?",
        "How is the humidity gonna be for the day?",
        "What's the humidity level for Sunday?",
        "What's the humidity tomorrow on Monday?",
        "What's the humidity tomorrow on Tuesday?",
        "What's the humidity tomorrow on Wednesday?",
        "What's the expected humidity tomorrow on Thursday?",
        "What's the humidity tomorrow on Friday?",
        "What's the humidity tomorrow on Saturday?",
        "What's the humidity tomorrow going to be like?",
        "What's the humidity level on Monday?",
        "Can you tell me the humidity for Tuesday?",
        "What's the expected humidity level for Wednesday?",
        "What's the humidity like on Thursday?",
        "What's the forecasted humidity level for Friday?",
        "Can you give me the humidity readings for Saturday?",
        "Do you know what the humidity will be like on Sunday?",
        "What's the humidity level for next Monday?",
        "What's the humidity gonna be for next sunday?",
        "What's the expected humidity level for next Tuesday?",
        "What's the forecasted humidity level for next Wednesday?",
        "What's the forecasted humidity level for next Sunday?",
        "What's the humidity level for the following Wednesday?",
        "Can you give me the humidity readings for next Monday?",
        "Can you tell me the humidity for next Thursday?",
        "Tell me the expected humidity level for next Saturday",
        "What's the humidity like on next Monday?",
        "What's the forecasted humidity level for next Wednesday?",
        "What's the humidity level for next Friday?",
        "Can you give me the humidity readings for next Sunday?",
        "What's the humidity like next Tuesday?",
        "What's the humidity level for the following Thursday?",
        "What's the expected humidity level for the upcoming Saturday?",
        "What's the forecasted humidity level for the upcoming Wednesday?",
        "What's the humidity level for the upcoming Monday?",
        "Can you tell me the humidity for the upcoming Friday?",
        "What's the humidity like for the following Sunday?",
        "Tell me the humidity level for the upcoming Tuesday?",
        "How humid is it gonna be today?",
        "How humid is it gonna be next tuesday?",
        "How humid will it be thursday?",
        "Can you tell me what the humidity level will be today?",
        "What is the expected humidity level for today?",
        "Could you let me know the humidity level for today?",
        "May I know the humidity level for today?",
        "What's the humidity level for today?",
        "Can you give me the humidity level for today?",
        "What is today's humidity level?",
        "What's the humidity gonna be like next friday?",
        "What's the humidity for next thursday?",
        "What's the humidity like today?",
        "Can you inform me about today's humidity level?",
        "I'm curious about today's humidity level, could you tell me?",
        "What will the humidity level be today?",
        "Could you provide me with today's humidity level?",
        "What is the humidity forecast for today?",
        "Can you give me the expected humidity for today?",
        "May I know today's expected humidity level?",
        "Is it gonna be humid today?",
        "Is it gonna be humid tomorrow?",
        "Is it gonna be humid on monday?",
        "Is it gonna be humid this friday?",
        "Is it gonna be humid next wednesday?",
        "What's the humidity going to be for the day?"
      ],
      "responses": [
        "The humidity level for {} ({}) is {}%.",
        "The humidity for {} ({}) is {}%.",
        "The average humidity for {} ({}) is {} percent.",
        "{} ({}):\n Humidity: {}%.",
        "The humidity forecast for {} ({}) is {}%.",
        "{}'s ({}) humidity is {}%.",
        "Humidity levels on {} ({}) will be about to {}%.",
        "Humidity levels on {} ({}) are expected to be about {}%."
      ],
      "context": "humidity forecast"
    },
    {
      "tag": "pressureForecast",
      "patterns": [
        "What's the air pressure like for tomorrow?",
        "Can you give me the air pressure level for Wednesday?",
        "What's the expected air pressure for Thursday?",
        "How much air pressure will there be on Friday?",
        "What's the air pressure level for Saturday?",
        "What's the air pressure forecast for Sunday?",
        "What's the projected air pressure level for Wednesday?",
        "What's the expected air pressure situation for Thursday?",
        "What's the forecasted air pressure for Friday?",
        "What's the air pressure outlook for Saturday?",
        "What's the air pressure status for Sunday?",
        "What's the air pressure like today?",
        "What's the air pressure tomorrow?",
        "How much air pressure will there be on Monday?",
        "What's the air pressure on Tuesday?",
        "What's the air pressure for Wednesday?",
        "What's the expected air pressure for Thursday?",
        "What's the air pressure on Friday?",
        "What's the air pressure like on Saturday?",
        "What's the air pressure level for Sunday?",
        "What's the air pressure for Monday?",
        "What's the air pressure for Tuesday?",
        "What is the air pressure gonna be for the day?",
        "What is the air pressure forecast for the day?",
        "How's the air pressure for the day?",
        "What is the air pressure going to be like for the day?",
        "Do you know what the air pressure will be like on friday?",
        "What's the air pressure going to be for the day?",
        "What's the air pressure for Wednesday?",
        "What's the expected air pressure for Thursday?",
        "What's the air pressure for Friday?",
        "What's the air pressure for Saturday?",
        "What's the air pressure level for Sunday?",
        "What's the air pressure tomorrow on Monday?",
        "What's the air pressure tomorrow on Tuesday?",
        "What's the air pressure tomorrow on Wednesday?",
        "What's the expected air pressure tomorrow on Thursday?",
        "What's the air pressure tomorrow on Friday?",
        "What's the air pressure tomorrow on Saturday?",
        "What's the air pressure tomorrow going to be like?",
        "What's the air pressure level on Monday?",
        "Can you tell me the air pressure for Tuesday?",
        "What's the expected air pressure level for Wednesday?",
        "What's the air pressure like on Thursday?",
        "What's the forecasted air pressure level for Friday?",
        "Can you give me the air pressure readings for Saturday?",
        "What's the air pressure like on Sunday?",
        "What's the air pressure level for next Monday?",
        "What's the expected air pressure level for next Tuesday?",
        "What's the forecasted air pressure level for next Wednesday?",
        "What's the forecasted air pressure level for next Sunday?",
        "What's the air pressure level for the following Wednesday?",
        "Can you give me the air pressure readings for next Monday?",
        "Can you tell me the air pressure for next Thursday?",
        "What's the expected air pressure level for next Saturday?",
        "What's the air pressure like on next Monday?",
        "What's the forecasted air pressure level for next Wednesday?",
        "What's the air pressure level for next Friday?",
        "Can you give me the air pressure readings for next Sunday?",
        "What's the air pressure like next Tuesday?",
        "What's the air pressure level for the following Thursday?",
        "What's the expected air pressure level for the upcoming Saturday?",
        "What's the forecasted air pressure level for today?",
        "What's the average air pressure level for tomorrow?",
        "What's the air pressure level today?",
        "What's the average air pressure level tomorrow?",
        "What's the average air pressure level on Monday?",
        "What's the air pressure level gonna be like today?",
        "Can you tell me what the air pressure for Tuesday is gonna be like?",
        "What's the expected air pressure level gonna be for Wednesday?",
        "What's the air pressure gonna be like on Thursday?",
        "What's the forecasted air pressure level gonna be for tomorrow?",
        "Can you give me the air pressure readings for today?",
        "What's the air pressure gonna be like on Sunday?",
        "What's the average air pressure for today?"
      ],
      "responses": [
        "The average air pressure for {} ({}) is {} hPa, or {} inHg (inches of mercury).",
        "Air pressure records for {} ({}) measure at {} hPa ({} inHg).",
        "The air pressure for {} ({}) is {} hPa ({} inHg).",
        "The average air pressure for {} ({}) is {} hPa ({} inHg).",
        "{} ({}):\n Air pressure: {} hPa ({} inHg).",
        "The air pressure forecast for {} ({}) is {} hPa ({} inHg).",
        "{}'s ({}) air pressure is {} hPa ({} inHg).",
        "Air pressure on {} ({}) will be about to {} hPa ({} inHg).",
        "Air pressure on {} ({}) is expected to be about {} hPa ({} inHg)."
      ],
      "context": "pressure forecast"
    },
    {
      "tag": "tempForecast",
      "patterns": [
        "What's the average temperature for today?",
        "What's the temperature like for today?",
        "Can you tell me the average temperature for today?",
        "What can I expect in terms of temperature for today?",
        "How hot will it be today?",
        "What's the forecast for today's temperature?",
        "Tell me about the temperature for today.",
        "What's the expected temperature for today?",
        "How warm will it be on sunday?",
        "What will be the average temperature for today?",
        "What's the temperature forecast for today?",
        "What's the average temperature like for today?",
        "What's the temperature for next wednesday?",
        "Can you give me the temperature details for today?",
        "What is the temperature going to be like for the day?",
        "What is the temperature gonna be for the day?",
        "How is the temperature going to be for the day?",
        "What's the temperature prediction for today?",
        "What's the projected temperature for today?",
        "Tell me about today's temperature.",
        "How hot is it gonna be on friday?",
        "How cold is it gonna be on thursday?",
        "What's the temperature outlook for today?",
        "How warm will it be today?",
        "What's the anticipated temperature for today?",
        "What's the temperature for this saturday?",
        "What's the average temperature for sunday?",
        "What's the weather like today? What's the average temperature?",
        "What's the average temperature for tomorrow?",
        "What's the temperature like for tomorrow?",
        "How warm is it gonna be today?",
        "How warm is it gonna be tomorrow?",
        "Can you tell me the average temperature for tomorrow?",
        "What can I expect in terms of temperature for tomorrow?",
        "How hot will it be tomorrow?",
        "How hot will it be on Thursday??",
        "How cold will it be on Thursday?",
        "What's the forecast for tomorrow's temperature?",
        "What's the temperature for monday?",
        "What's the temperature for tomorrow?",
        "Tell me about the temperature for tomorrow.",
        "What's the expected temperature for tomorrow?",
        "What will be the average temperature for tomorrow?",
        "What's the temperature forecast for tomorrow?",
        "What's the average temperature like for tomorrow?",
        "Can you give me the temperature details for tomorrow?",
        "What's the expected weather for tomorrow?",
        "What's the temperature prediction for tomorrow?",
        "What's the projected temperature for tomorrow?",
        "Tell me about tomorrow's temperature.",
        "What's the temperature outlook for tomorrow?",
        "How warm will it be tomorrow?",
        "How chilly will it be on Thursday?",
        "How chilly will it be on saturday?",
        "What's the anticipated temperature for tomorrow?",
        "Do you know what the average temperature will be like tomorrow?",
        "What's the average temperature for Tuesday?",
        "What's the temperature like for Tuesday?",
        "Can you tell me the average temperature for Tuesday?",
        "What can I expect in terms of temperature for Tuesday?",
        "How hot will it be on Tuesday?",
        "How cold will it be on Sunday?",
        "What's the forecast for Tuesday's temperature?",
        "Tell me about the temperature for Tuesday.",
        "What's the expected temperature for Tuesday?",
        "What will be the average temperature for Tuesday?",
        "What's the temperature forecast for Tuesday?",
        "What's the average temperature like for Tuesday?",
        "Can you give me the temperature details for Tuesday?",
        "What's the expected weather for Tuesday?",
        "What's the temperature prediction for Tuesday?",
        "What's the projected temperature for Tuesday?",
        "Tell me about Tuesday's temperature.",
        "What's the temperature outlook for Tuesday?",
        "How warm will it be on Tuesday?",
        "How chilly will it be on Sunday?",
        "What's the anticipated temperature for Tuesday?",
        "What's the weather like on Tuesday? What's the average temperature?",
        "What's the average temperature for Wednesday?",
        "What's the temperature like for Wednesday?",
        "Can you tell me the average temperature for Wednesday?",
        "What can I expect in terms of temperature for Wednesday?",
        "How hot will it be on Wednesday?",
        "What's the forecast for Wednesday's temperature?",
        "What's the estimated average temperature for Monday?",
        "Can you provide me with the average temperature for Thursday?",
        "What's the expected average temperature for Friday?",
        "What's the projected average temperature for Saturday?",
        "What's the anticipated average temperature for Sunday?",
        "Can you tell me the average temperature for the upcoming Monday?",
        "What is the average temperature gonna be tomorrow?",
        "What is the temperature gonna be like tomorrow?",
        "What is the temperature gonna be like today?",
        "What is the temperature gonna be on monday?",
        "What's the temperature gonna be like on tuesday?",
        "What's the temperature gonna be on wednesday?",
        "Do you know how hot it's gonna be on thursday?",
        "Can you tell me how cold it's going to be on sunday?",
        "What's the average temperature going to be like next thursday?",
        "What's the temperature gonna be like on average next friday?",
        "What's the average temperature gonna be like next saturday?",
        "How hot is it gonna be next sunday?",
        "How cold is it gonna be next monday?",
        "How hot is it gonna be next tuesday?",
        "How hot is it going to be tomorrow?",
        "How cold is it going to be today?",
        "What's the average temperature for tuesday?",
        "How hot is it going to be on tuesday?",
        "What's the temperature for the day?",
        "What's the temperature like for the day?"
      ],
      "responses": [
        "The temperature for {} ({}) is {} degrees.",
        "The daily temperature for {} ({}) is {}°F.",
        "The temperature for {} ({}) is {}°F.",
        "{} ({}):\n Average temperature: {}°F.",
        "The temperature forecast for {} ({}) is {}°F.",
        "{}'s ({}) temperature is {}°F.",
        "Temperatures on {} ({}) will be around {}°F.",
        "Temperatures on {} ({}) are expected to be around {}°F."
      ],
      "context": "temp forecast"
    },
    {
      "tag": "dewForecast",
      "patterns": [
        "What's the dew point gonna be today?",
        "What's the dew point going to be tomorrow?",
        "What is the dew point going to be on monday?",
        "What's the dew point gonna be on tuesday?",
        "What is the dew point for tuesday?",
        "Tell me the dew point for tomorrow?",
        "What does the dew point for today look like?",
        "Give me the dew point for tomorrow?",
        "What is the dew point going to be for today?",
        "What's the expected dew point for tomorrow?",
        "Can you tell me the projected dew point for today?",
        "What's the anticipated dew point for tomorrow?",
        "What's the estimated dew point for today?",
        "What's the dew point for tomorrow?",
        "What is the dew point going to be for this wednesday?",
        "What's the expected dew point for today?",
        "Can you tell me the projected dew point for tomorrow?",
        "What's the anticipated dew point for Wednesday?",
        "What's the estimated dew point for Tuesday?",
        "What's the dew point for Saturday?",
        "Can you provide me with the expected dew point for Monday?",
        "What's the projected dew point for Thursday?",
        "What is the dew point for the day?",
        "What is the dew point going to be for the day?",
        "How is the dew going to be for the day?",
        "What is the dew going to be like for the day?",
        "What's the dew point for this Friday?",
        "What's the anticipated dew point for Saturday?",
        "What's the estimated dew point for Sunday?",
        "Can you tell me the expected dew point for the upcoming Monday?",
        "What's the dew point for Thursday?",
        "What's the anticipated dew point for Friday?",
        "What's the estimated dew point for Saturday?",
        "What's the dew point for next friday?",
        "What's the projected dew point for Sunday?",
        "Do you know what the dew levels will be like on saturday?",
        "Are you able to tell me what the dew is gonna be like tomorrow?",
        "What's the forecasted dew point for this sunday?",
        "What's the dew point for Monday?",
        "Can you provide me with the projected dew point for Thursday?",
        "What's the anticipated dew point for this Friday?",
        "What's the estimated dew point for Saturday ?",
        "What's the dew point for Sunday?",
        "Can you tell me the expected dew point for next Monday?",
        "What's the projected dew point for this Thursday?",
        "What's the anticipated dew point for this Friday?",
        "What's the estimated dew point for this Saturday?",
        "What's the dew point for Monday?",
        "Can you provide me with the anticipated dew point for Thursday?",
        "What's the projected dew point for Sunday?",
        "What's the anticipated dew point for next Saturday?",
        "What's the estimated dew point for this Monday?",
        "What's the dew point for Thursday?",
        "Can you tell me the expected dew point for next Friday?",
        "What's the projected dew point for next Saturday?",
        "What's the anticipated dew point for next Sunday?",
        "What's the estimated dew point for next Monday?",
        "What's the dew point for Thursday?",
        "Can you provide me with the anticipated dew point for next Saturday?",
        "What's the projected dew point for Sunday?",
        "What's the anticipated dew point for this Wednesday?",
        "What's the estimated dew point for next Monday?",
        "What's the dew point for Saturday?",
        "Can you tell me the expected dew point for Sunday?",
        "What's the projected dew point for Monday?",
        "What's the anticipated dew point for this Wednesday?",
        "What's the estimated dew point for next Thursday?",
        "What's the dew point for this Saturday?",
        "Can you provide me with the expected dew point for this Sunday?",
        "What's the projected dew point for this Monday?",
        "What's the anticipated dew point for this Thursday?",
        "What's the estimated dew point for this Tuesday?",
        "What's the dew point for this Sunday?",
        "Can you tell me the expected dew point for Monday?",
        "Can you give me the dew forecast for today?",
        "What is the dew forecast for tomorrow like?",
        "Do you know the dew point for monday?",
        "What is the dew forecast for tuesday?",
        "Tell me dew for wednesday?",
        "What is the dew for thursday?",
        "What is the dew forcast for tomorrow?",
        "What's the dew like for this sunday?",
        "What's the dew gonna be like for next tuesday?",
        "Can you tell me the dew forcast for sunday?"
      ],
      "responses": [
        "The dew point for {} ({}) is {} Kelvin ({}°F).",
        "The dew point level for {} ({}) is {} Kelvin ({}° Fahrenheit).",
        "{}'s ({}) dew point is {} Kelvin ({}°F).",
        "{} ({}):\n Dew Point: {} Kelvin ({}°F).",
        "The dew point forecast for {} ({}) is {} Kelvin, or {}°F.",
        "{}'s ({}) average dew point is {} Kelvin ({}°F).",
        "The dew point on {} ({}) will be around {} Kelvin, or {}°F.",
        "The dew point for {} ({}) is expected to be around {} Kelvin ({}°F)."
      ],
      "context": "dew forecast"
    },
    {
      "tag": "weatherWeek",
      "patterns": [
        "What's the forecast for the next  days?",
        "Can you give me an idea of what the weather will be like this week?",
        "What can I expect from the weather over the next few days?",
        "Will it be warm this week?",
        "Any idea what the temperatures will be like this week?",
        "Could you tell me what to expect for weather this week?",
        "What are the chances of rain for the next  days?",
        "Is there any storm forecast for the upcoming week?",
        "What does the weather look like for these next few days?",
        "Can you tell me what the upcoming week's weather will be like?",
        "What will the weather be like for the next week?",
        "What should I expect from the weather this week?",
        "Any idea what the weather will be like for the next few days?",
        "What's the weather looking like for this week?",
        "Is it going to be sunny this week?",
        "Can you tell me the weather for the next  days?",
        "What's the weather forecast for the next few days?",
        "What kind of weather can we expect over the next  days?",
        "What's the outlook for the weather this week?",
        "Can you give me an idea of what the temperatures will be this week?",
        "What's the weather going to be like over the next few days?",
        "What's the prediction for the weather over the next week?",
        "Can you give me a weather update for the next  days?",
        "What kind of weather is coming up in the next week?",
        "What's the weather report for this week?",
        "What's the weather looking like for the upcoming week?",
        "Are there any changes in the weather forecast for the next  days?",
        "What's the temperature going to be like for the upcoming week?",
        "Can you tell me what the weather outlook is for the next few days?",
        "What's the weather going to be like for the rest of this week?",
        "Are there any weather warnings for the upcoming week?",
        "What will the weather conditions be like for the next few days?",
        "What does the weather forecast show for the next  days?",
        "What's the weather prediction for this week?",
        "What will the weather be like for the rest of the week?",
        "Is there any chance of snow this week?",
        "What's the weather going to be like over the next  days?",
        "Can you give me an update on the weather forecast for the next week?",
        "What's the temperature forecast for this week?",
        "What's the outlook for the weather over the next few days?",
        "Can you tell me what the weather will be like for the upcoming week?",
        "What's the weather forecast looking like for these next few days?",
        "What's the weather looking like for the next week or so?",
        "Will it be sunny this week?",
        "Is the weather going to be mild or hot this week?",
        "What are the temperatures supposed to be like for the next week?",
        "What can I expect from the weather this upcoming week?",
        "Are there any major weather events expected in the next  days?",
        "What's the general weather forecast for the upcoming week?",
        "What will the weather be like over the next several days?",
        "Can you give me a weather update for the upcoming week?",
        "What kind of weather can we expect this week?",
        "What are the chances of thunderstorms for the next  days?",
        "What's the temperature range for this week?",
        "Can you give me a rundown of the weather for the next few days?",
        "What's the outlook for the weather in the upcoming week?",
        "What's the weather looking like for the next  days?",
        "Can you tell me what the weather will be like this week, temperature-wise?",
        "Is there any chance of a heat wave this week?",
        "Will it be clear or cloudy this week?",
        "What's the weather forecast for the week  ?",
        "Is there any chance of severe weather this week?",
        "Will we be experiencing any extreme weather conditions this week?",
        "Are there any upcoming weather-related events in the area?",
        "Can you give me an update on the weather patterns for this week?",
        "Will there be any sudden changes in weather this week?",
        "Can you tell me what the dew point will be like for the next few days?",
        "Are there any weather advisories in effect for the next  days?",
        "What's the forecast for the upcoming weekend's weather?",
        "Can you give me a brief summary of the weather for the next week?",
        "Can you give me an idea of the cloud cover forecast for the next few days?",
        "Will there be any temperature fluctuations this week?",
        "Can you tell me what the weather will be like during the day and night for the next few days?",
        "What's the weather gonna be like this week?",
        "Can you tell me what the weather is gonna be like this week?",
        "What is the weather gonna be like this week?",
        "Can you tell me what the weather is gonna be like this week?",
        "What is the weather going to be like this week?",
        "Can you tell me what the weather is going to be like this week?",
        "Can you tell me what the weather is gonna be like for the next  days?",
        "What is the weather gonna be like for the next  days?",
        "Can you tell me what the weather is gonna be like for the next  days?",
        "What is the weather going to be like for the next  days??",
        "Can you tell me what the weather is going to be like for the next  days?",
        "Give me a weekly weather forecast",
        "Weekly weather forecast please",
        "What's the weather like this week?",
        "What is the weather like this week?",
        "Can you give me this week's weather forecast?",
        "What is this week's weather gonna be like?",
        "What is this week's weather like?",
        "Give me an update on this week's weather",
        "How's the weather for this week?",
        "How is the weather forcast for this week?",
        "Can you tell me about the weekly weather forecast?",
        "What does the weekly weather forecast look like?",
        "Can you give me the weekly weather forecast?",
        "How's the weekly weather?",
        "Do you know the weekly weather?"
      ],
      "responses": [
        [
          "Here is a weather forecast for the next 7 days:\n",
          "I've created a weather forecast for the upcoming week:\n",
          "I've collected some data for a weekly forecast:\n",
          "Here is a weekly weather forecast:\n",
          "I've gathered some weather data for the next 7 days. Here you go, sir.\n"
        ],
        [
          "\n     Average temperature: {}°F.\n     Low: {}°F.\n     High: {}°F.\n     Average UVI: {}.\n\n     Average Wind Speed: {}mph., with gusts up to {}.\n     Average cloud coverage: {}%.\n\n     Precipitation: {}% chance of {}.\n\n"
        ]
      ],
      "context": "weather week"
    },
    {
      "tag": "tempWeek",
      "patterns": [
        "What is the temperature forecast gonna be for the rest of the week?",
        "What's the temperature gonna be like for the rest of the week?",
        "How hot is it gonna be this week?",
        "How cold is it gonna be this week?",
        "How hot is it this week?",
        "How cold is it this week?",
        "How hot is it going to be for the rest of this week?",
        "How cold is it going to be this week?",
        "How hot is it going to be this week?",
        "What's the temperature like this week?",
        "How hot is it going to be for the next  days?",
        "How cold is it going to be for the next  days?",
        "What's the average temperature going to be for the next  days?",
        "What's the temperature going to be like for the next  days?",
        "What is the average temperature gonna be like this week?",
        "What's the average temperature gonna be this week?",
        "What is the average temperature going to be for this week?",
        "What's the average temperature going to be for the rest of this week?",
        "What's the average temperature for this week?",
        "Can you tell me the projected average temperature for the rest of the week?",
        "What's the anticipated average temperature for the next  days?",
        "What's the estimated average temperature for the next week?",
        "What's the average temperature expected for the upcoming week?",
        "Can you provide me with the average temperature for the next  days?",
        "What is the projected average temperature for the rest of the week?",
        "What is the average temperature for the remaining days of the week?",
        "What is the anticipated average temperature for the next week?",
        "What is the estimated average temperature for this week?",
        "Can you tell me the expected average temperature for the upcoming week?",
        "What's the average temperature for the current week?",
        "What is the projected average temperature for the next  days?",
        "What's the anticipated average temperature for the rest of the week?",
        "What is the estimated average temperature for the upcoming week?",
        "What is the average temperature expected for this week?",
        "Can you provide me with the projected average temperature for the next  days?",
        "What's the anticipated average temperature for the remaining days of the week?",
        "What is the estimated average temperature for the rest of the week?",
        "What's the average temperature for the next week?",
        "Can you tell me the expected average temperature for the next  days?",
        "What is the projected average temperature for the current week?",
        "What is the anticipated average temperature for the upcoming week?",
        "What is the estimated average temperature for the remaining days of the week?",
        "What is the average temperature for the next  days?",
        "Can you provide me with the expected average temperature for the rest of the week?",
        "What is the projected average temperature for the next week?",
        "What is the anticipated average temperature for this week?",
        "What is the estimated average temperature for the next  days?",
        "What is the average temperature for the upcoming week?",
        "Can you tell me the projected average temperature for the remaining days of the week?",
        "What's the anticipated average temperature for the next  days?",
        "What's the estimated average temperature for the current week?",
        "What's the average temperature for the rest of the week?",
        "Can you provide me with the expected average temperature for the next week?",
        "What's the projected average temperature for the next  days?",
        "What's the anticipated average temperature for the remaining days of the week?",
        "What's the estimated average temperature for the upcoming week?",
        "What's the average temperature for this week?",
        "Can you tell me the expected average temperature for the rest of the week?",
        "What is the projected average temperature for the next week?",
        "What is the anticipated average temperature for the next  days?",
        "What is the estimated average temperature for the remaining days of the week?",
        "What's the average temperature for the next  days?",
        "Can you provide me with the expected average temperature for the upcoming week?",
        "What is the projected average temperature for this week?",
        "What is the anticipated average temperature for the rest of the week?",
        "What is the estimated average temperature for the next week?",
        "What is the average temperature for the remaining days of the week?",
        "What's the temperature look like this week?",
        "What is the temperature going to be like this week?",
        "Can you give me a weekly temperature report?",
        "What's the weekly temperature report like?",
        "Do you know the weekly temperature?",
        "Tell me the the weekly temperature forecast?",
        "How hot is it getting this week?",
        "How cold is it getting this week?",
        "Can you give me the weekly temperature?",
        "What's the temperature like this week?",
        "What is the temperature like this week?"
      ],
      "responses": [
        [
          "Here is a temperature forecast for the next 7 days:\n",
          "I've went and gathered some data for this week's temperatures\n",
          "I've created a temperature report for the next 7 days:\n",
          "I've gathered the temperature data for the rest of this week. Here you go, sir.\n"
        ],
        [
          "\n     Average temperature: {}°F.\n     Low: {}°F.\n     High: {}°F.\n\n"
        ]
      ],
      "context": "temp week"
    },
    {
      "tag": "humidityWeek",
      "patterns": [
        "What's the humidity level gonna be like for the whole week?",
        "Is the humidity going to be bad this week?",
        "Is the humidity going to be good this week?",
        "How is the humidity gonna be this week?",
        "What is the humidity percentage going to be like for the whole week?",
        "Do you know the humidity levels for the whole week?",
        "What's the humidity level for the rest of the week?",
        "Can you tell me the humidity for the rest of the week?",
        "What's the humidity for the week?",
        "What is the weekly humidity forecast looking like?",
        "Give me a weekly humidity forecast?",
        "How humid is it gonna be this week?",
        "How humid is it going to be this week?",
        "Is it gonna be humid this week?",
        "Is it going to be humid this week?",
        "What's the humidity like this week?",
        "Can you tell me the humidity levels for this week?",
        "How humid will it be this week?",
        "What's the expected humidity level for the upcoming week?",
        "Do you have information on the humidity levels this week?",
        "Could you provide me with the humidity forecast for this week?",
        "What's the humidity like in the coming week?",
        "Any idea about the humidity levels for the week  ?",
        "Can you give me an estimate of the humidity levels this week?",
        "What's the humidity expected to be this week?",
        "Any updates on the humidity levels for the upcoming week?",
        "Do you have the humidity forecast for this week?",
        "Could you tell me about the humidity this week?",
        "What are the humidity levels expected to be this week?",
        "Can you provide me with the humidity outlook for the week?",
        "How humid will it get this week?",
        "What's the expected humidity for the upcoming week?",
        "Do you know the humidity levels for this week?",
        "What's the humidity like for the coming week?",
        "Any information on the humidity levels this week?",
        "Can you give me an idea of the humidity this week?",
        "What's the anticipated humidity for this week?",
        "What's the humidity forecast for the week?",
        "Could you tell me the expected humidity this week?",
        "What's the projected humidity for this week?",
        "How humid will it be in the coming week?",
        "What's the estimated humidity levels for this week?",
        "What's the expected humidity for the next  days?",
        "Do you know the humidity levels for the next  days?",
        "What's the humidity like for the next  days?",
        "Any information on the humidity levels for the next  days?",
        "Can you give me an idea of the humidity for the next  days?",
        "What's the anticipated humidity for the next  days?",
        "What's the humidity forecast for the next  days?",
        "Could you tell me the expected humidity the next  days?",
        "What's the projected humidity for the next  days?",
        "How humid will it be in the coming  days?",
        "What's the estimated humidity levels for the next  days?"
      ],
      "responses": [
        [
          "Here is a humidty forecast for the next 7 days:\n",
          "I've gathered the humidity forecasts for the next 7 days. Here you go, sir.\n",
          "Here is the humidity report for the next week:\n",
          "I've created a report on the humidity levels for the next 7 days:\n",
          "I've gathered the humidity level data for the next week:\n",
          "I've looked into the humidity levels for the next week, and made a report:\n"
        ],
        ["\n     Average humidity: {}%.\n\n"]
      ],
      "context": "humidity week"
    },
    {
      "tag": "uviWeek",
      "patterns": [
        "What is the weekly UV forecast?",
        "What is the weekly UVI index report?",
        "What is the UVI index for the whole week?",
        "What are the UVI indexes for the next days?",
        "What is the UV index for the next  days?",
        "Can you tell me the UV index for the next week?",
        "What is the UV index like for this week?",
        "How high is the UV index for the next days?",
        "Can you give me the daily UV index for this week?",
        "What is the UVI forecast for the next week?",
        "What is the UV index prediction for the upcoming week?",
        "Can you tell me the UV index levels for this week?",
        "How strong is the UV index for the next  days?",
        "What is the UV index going to be like for the next week?",
        "Can you give me an idea of the UV index for this week?",
        "What is the projected UV index for the next  days?",
        "What is the expected UV index for the upcoming week?",
        "What is the UV index outlook for this week?",
        "What is the UVI estimate for the next  days?",
        "Can you provide me with the daily UV index for this week?",
        "What is the UV index for the upcoming week?",
        "What is the UV index situation for this week?",
        "How intense is the UV index for the next  days?",
        "What is the UV index status for the next week?",
        "Can you let me know the UV index range for this week?",
        "What is the UVI index report for the next  days?",
        "What is the UVI index summary for the upcoming week?",
        "What is the UV index situation like for this week?",
        "Can you give me the UV index data for the next week?",
        "What is the UV index measurement for the next  days?",
        "What is the UVI condition for this week?",
        "What is the UV index level going to be for the next week?",
        "Can you provide me with the UV index information for this week?",
        "What is the UV index projection for the next  days?",
        "What is the UVI prediction for this week?",
        "What is the UVI range like for the upcoming week?",
        "What is the UV index outlook for the next  days?",
        "What is the UV index trend for this week?",
        "Can you give me an estimate of the UV index for the next week?",
        "What is the UVI update for the next  days?",
        "What is the UV index forecast like for this week?",
        "What is the UV index trend going to be for the upcoming week?",
        "What is the UVI index status update for this week?",
        "Can you tell me the UV index range for the next  days?",
        "What is the UVI data like for the upcoming week?",
        "What is the UV index summary for this week?",
        "What is the UV index information for the next  days?",
        "What is the UVI index update for the upcoming week?",
        "What is the UV index report like for this week?",
        "What is the UV index situation going to be for the next  days?",
        "Can you give me the UV index measurement for this week?",
        "What is the UVI condition like for the next week?",
        "What is the UV index projection for this week?",
        "What is the UVI index level like for this week?",
        "What is the UV index prediction for the upcoming week?",
        "What is the UV index forecast going to be for the next  days?",
        "Can you tell me the weekly UV forecast?",
        "What does the weekly UVI forecast look like?",
        "What is the weekly UV report?",
        "What's the weekly UVI report?",
        "What's the UVI report for the week?",
        "Tell me the UVI forecast for the week?",
        "Tell me the UVI forecast for the week?",
        "What does the UV report for the week look like?",
        "How does the UV forecast for the next  days look?",
        "How does the UVI report for the week look?",
        "What's the UV report for the week?",
        "What's the UVI forecast for the next  days?"
      ],
      "responses": [
        [
          "Here is a UV index forecast for the next 7 days:\n",
          "I've gathered the UV index forecast for the next 7 days. Here you go, sir.\n",
          "Here is the UV index report for the next week:\n",
          "I've created a report on the UVI for the next 7 days:\n",
          "I've gathered the UV index data for the next week:\n",
          "I've looked into the UV index for the next week, here is a report:\n"
        ],
        ["\n     Daily UVI : {}%.\n\n"]
      ],
      "context": "uvi week"
    },
    {
      "tag": "windWeek",
      "patterns": [
        "Could you give me a weekly wind forecast?",
        "What is the weekly wind forecast?",
        "What is the weekly wind report?",
        "What is the wind for the whole week?",
        "What's the wind for the week?",
        "What is the wind doing this week?",
        "What is the wind for the whole week?",
        "What is the wind like for the rest of the week?",
        "How windy is it gonna be this week?",
        "Is it gonna be windy this week?",
        "How windy is it going to be this week?",
        "Is it going to be windy this week?",
        "What are the wind speeds going to be for the whole week?",
        "What's the wind going to be like this week?",
        "What is the wind going to be like for the next  days?",
        "What are the wind speeds for the upcoming week?",
        "Can you provide me with the wind speeds for the next  days?",
        "What is the wind forecast for the next week?",
        "What are the expected wind speeds over the next  days?",
        "Can you tell me the wind speeds for this week?",
        "What kind of wind speeds can we expect for the next  days?",
        "What are the wind speeds going to be like this week?",
        "Could you give me an idea of the wind speeds for the upcoming week?",
        "What will the wind speeds be for the next  days?",
        "What is the wind speed outlook for this week?",
        "Can you tell me the wind speeds for the next week?",
        "How windy is it going to be this week?",
        "What is the wind speed forecast for the next  days?",
        "Can you provide me with the wind speeds for the upcoming week?",
        "What are the expected wind speeds for this week?",
        "What are the wind speeds looking like for the next  days?",
        "What will the wind speeds be like this week?",
        "Can you give me an update on the wind speeds for the next week?",
        "What is the wind speed prediction for the next  days?",
        "What kind of wind speeds should we expect this week?",
        "What are the wind speeds going to look like this week?",
        "What can you tell me about the wind speeds for the next  days?",
        "How strong will the wind be this week?",
        "What is the wind speed outlook for the upcoming week?",
        "What is the wind speed forecast for this week?",
        "Can you give me the wind speed report for the next  days?",
        "What are the wind speeds going to be over the next week?",
        "What are the wind speeds expected to be this week?",
        "What is the wind speed estimate for the upcoming week?",
        "What kind of wind speeds will we be experiencing this week?",
        "Can you tell me about the wind speeds for the next  days?",
        "What will the wind be like over the next week?",
        "What is the wind speed projection for this week?",
        "What are the wind speeds predicted to be for the upcoming week?",
        "What is the wind speed situation for this week?",
        "Can you provide me with an update on the wind speeds for the next  days?",
        "What is the wind speed outlook for the next week?",
        "What are the wind speeds going to be in the upcoming week?",
        "What can you tell me about the wind speeds for this week?",
        "What kind of wind speeds are expected for the next  days?",
        "Can you give me an overview of the wind speeds for the next week?",
        "What are the wind speeds anticipated to be this week?",
        "What is the wind speed status for the next  days?",
        "What will the wind speeds look like over the next week?",
        "What are the wind speeds going to be similar to this week?",
        "Can you tell me what to expect in terms of wind speeds for the upcoming week?",
        "What is the wind speed update for this week?",
        "What's the wind forecast for this week looking like?",
        "How's the wind forecast for this week?"
      ],
      "responses": [
        [
          "Here is a wind forecast for the next 7 days:\n",
          "I've gathered the wind forecast for the next week. Here you go, sir.\n",
          "Here is the wind report for the next 7 days:\n",
          "I've created a report on the wind speeds for the next 7 days:\n",
          "I've gathered the wind data for the next 7 days:\n",
          "I've went ahead and created a wind report for the next 7 days:\n"
        ],
        ["\n     Wind speed: {}mph., with gusts up to {}mph.\n\n"]
      ],
      "context": "wind week"
    },
    {
      "tag": "contextWeekly",
      "patterns": [
        "What about for this week?",
        "How about for this week?",
        "What about for the rest of this week?",
        "How about for the rest of this week?",
        "What about for the next  days?",
        "How about for the next  days?",
        "What about a report for the next few days?",
        "And for this week?",
        "And for the rest of this week?",
        "And for the week?",
        "And for the rest of the week?",
        "How about for the rest of the week?",
        "What about for the rest of the week?",
        "Can you give me a weekly forecast?",
        "Can you give me a weekly report?",
        "What about a weekly report?",
        "What about a weekly forecast?",
        "And the weekly report?",
        "And the weekly forecast?",
        "And for the next  days?",
        "What about the weekly forecast?",
        "How about the weekly forecast?",
        "Can you give me a report for the whole week?",
        "What about a report for the whole week?",
        "What about a forecast for the whole week?",
        "And a forecast for the whole week?",
        "What about the whole week?",
        "How about the whole week?",
        "And for the whole week?",
        "What about for the entire week?",
        "How about for the entire week?",
        "What about for the next  days?",
        "And for the next  days?",
        "And the next  days?",
        "What about for the next  days?",
        "How about for the next  days?",
        "What about for the remaining days of the week?",
        "How about for the remaining days of the week?",
        "And for the remaining days of the week?",
        "What about for the upcoming week?",
        "How about for the upcoming week?",
        "What about for the rest of the week's forecast?",
        "How about for the rest of the week's forecast?",
        "And for the rest of the week's forecast?",
        "For the whole week",
        "For the week",
        "And a weekly forecast?",
        "What about a weekly forecast?",
        "What about a forecast for the next few days?",
        "How about a weekly forecast?",
        "And a weekly report?",
        "How about a weekly report?",
        "What about a weekly report?",
        "What about for the week?",
        "What about the  day report?",
        "What about for the next  days?",
        "How about for the next  days?",
        "And for the next  days?",
        "And for the rest of the week?",
        "And for the whole week?",
        "What about the weekly report?",
        "How about a weelky report?",
        "And a forecast for the week?",
        "And a  day forecast?",
        "How about a  day forecast?",
        "For the rest of the week",
        "For this whole week",
        "Now a weekly report",
        "Now a weekly forecast",
        "Now a report for the whole week",
        "Now a report for the rest of the week",
        "Now a report for the next  days",
        "Now a forecast for the whole week",
        "Now a forecast for the next  days",
        "Now a forecast for the whole week",
        "Now a forecast for the next  days",
        "Now for the week",
        "Now for the whole week",
        "Now for the next  days",
        "Now for the next week",
        "What about for the next week?",
        "How about for the next week?",
        "And for the next week?",
        "What about for the next few days?",
        "And for the next few days?",
        "How about for the next few days?"
      ],
      "responses": [
        "I'm sorry. Could you provide more context?",
        "My apologies. Could you provide more context?",
        "Could you please provide more context?",
        "Sorry. Could you give some context?"
      ]
    },
    {
      "tag": "contextForecast",
      "patterns": [
        "What about for today?",
        "And for today?",
        "How about for today?",
        "Now a forecast for today",
        "What about a forecast for today?",
        "How about a forecast for today?",
        "What about for the rest of today?",
        "How about for the rest of today?",
        "And for today?",
        "What about the average for today?",
        "How about the average for today?",
        "And the average for tomorrow?",
        "What about the average for tomorrow?",
        "And the average for wednesday?",
        "Can you give me a forecast for the whole week?",
        "What about just for wednesday?",
        "How about just for thursday?",
        "What about a forecast for next thursday?",
        "How about a forecast for next monday?",
        "And the average for next tuesday?",
        "What about the average for next wednesday?",
        "How about the average forecast for this thursday?",
        "And the average for this friday?",
        "What about the average for this saturday?",
        "And how about this sunday?",
        "What about this monday?",
        "What about just for saturday?",
        "And just for monday?",
        "How about just for today?",
        "What about just for tomorrrow?",
        "And just for tuesday?",
        "What about just for thursday?",
        "How about just for friday?",
        "What about just for tomorrow?",
        "And just for tomorrow?",
        "How about just for tomorrow?",
        "And for tomorrow?",
        "What about tomorrow?",
        "And tomorrow?",
        "And for the rest of today?",
        "And for tomorrow?",
        "How about for tomorrow?",
        "Now for monday",
        "Now for tuesday",
        "Now for wednesday",
        "Now for thursday",
        "Now for friday",
        "Now for today",
        "Now for tomorrow",
        "Now a forecast for tomorrow",
        "What about a forecast for tomorrow?",
        "How about a forecast for tomorrow?",
        "What about for the rest of tomorrow?",
        "How about for the rest of tomorrow?",
        "And for the rest of tomorrow?",
        "And a forecast for tomorrow?",
        "What about for monday?",
        "And for monday?",
        "How about for monday?",
        "Now a forecast for monday",
        "What about a forecast for sunday?",
        "And for sunday?",
        "How about a forecast for sunday?",
        "And for sunday?",
        "What about for tuesday?",
        "And for tuesday?",
        "What about for tomorrow?",
        "How about for tuesday?",
        "Now a forecast for tuesday",
        "What about a forecast for friday?",
        "And for friday?",
        "How about a forecast for friday?",
        "And for friday?",
        "What about for wednesday?",
        "And for wednesday?",
        "And a forecast for thursday?",
        "And for friday?",
        "How about for saturday?",
        "What about a report for sunday?",
        "How about a report for tomorrow?",
        "What about a forecast for monday?",
        "And for tuesday?",
        "And for wednesday?",
        "How about for thursday?",
        "What about a forecast for friday?",
        "And a report for saturday?",
        "How about for wednesday?",
        "Now a forecast for wednesday",
        "What about a forecast for thursday?",
        "And for thursday?",
        "How about a forecast for thursday?",
        "And for thursday?",
        "How about for tomorrow?",
        "What about the forecast for the day?",
        "What about for the rest of the day?",
        "How about the rest of the day?",
        "What about for the rest of today?",
        "And for the rest of the day?",
        "How about a report for the day?",
        "How about for today?",
        "What about for the rest of the day?",
        "How about for the rest of the day?",
        "And for the day?",
        "What about for the day?",
        "How about for the day?"
      ],
      "responses": [
        "I'm sorry. Could you provide more context?",
        "My apologies. Could you provide more context?",
        "Could you please provide more context?",
        "Sorry. Could you give some context?"
      ]
    },
    {
      "tag": "contextCurrently",
      "patterns": [
        "What about for right now?",
        "And for right now?",
        "How about for right now?",
        "Now a forecast for right now",
        "What about currently?",
        "And currently?",
        "How about currently?",
        "And right now?",
        "And rn?",
        "What about a forecast for now?",
        "How about rn?",
        "What about rn?",
        "And for rn?",
        "Now for rn",
        "Now for right now",
        "Now for now",
        "How about for now?",
        "Now for currently",
        "Now currently",
        "What about a current forecast?",
        "How about a current forecast?",
        "And a current forecast?",
        "And currently?",
        "And a current report?",
        "And a report for right now?",
        "And a forecast for right now?",
        "How about a forecast for right now?",
        "What about for right now?",
        "And right now?",
        "What about a forecast for rn?",
        "How about a forecast for rn?",
        "How about a report for rn?",
        "What about a report for rn?",
        "And just for right now?",
        "Can you give a forecast just for right now?",
        "What about just for right now?",
        "How about just for right now?",
        "Can you give me a current forecast?",
        "What about a current forecast",
        "What about a current report"
      ],
      "responses": [
        "I'm sorry. Could you provide more context?",
        "My apologies. Could you provide more context?",
        "Could you please provide more context?",
        "Sorry. Could you give some context?"
      ]
    }
  ]
}
